----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Deleg
> ates\8_Submission\replication_delegates/scripts/logs/2024.08.07-16.36.59.log.txt
  log type:  text
 opened on:   7 Aug 2024, 16:36:59

. 
. di "Begin date and time: $S_DATE $S_TIME"
Begin date and time:  7 Aug 2024 16:36:59

. di "Stata version: `c(stata_version)'"
Stata version: 16.1

. di "Updated as of: `c(born_date)'"
Updated as of: 11 Oct 2022

. di "Variant:       `=cond( c(MP),"MP",cond(c(SE),"SE",c(flavor)) )'"
Variant:       MP

. di "Processors:    `c(processors)'"
Processors:    2

. di "OS:            `c(os)' `c(osdtl)'"
OS:            Windows 64-bit

. di "Machine type:  `c(machine_type)'"
Machine type:  PC (64-bit x86-64)

. 
. *   Analyses were run on Windows using Stata version 16
. version 16              // Set Version number for backward compatibility

. 
. /* All required Stata packages are available in the /libraries/stata folder
> tokenize `"$S_ADO"', parse(";")
> while `"`1'"' != "" {
>   if `"`1'"'!="BASE" cap adopath - `"`1'"'
>   macro shift
> }
> adopath ++ "$working_ANALYSIS/scripts/libraries/stata"
> mata: mata mlib index
> */
. 
. * Create directories for output files
. cap mkdir "$working_ANALYSIS/results"

. cap mkdir "$working_ANALYSIS/results/intermediate"

. cap mkdir "$working_ANALYSIS/results/tables"

. cap mkdir "$working_ANALYSIS/results/figures"

. * -------------------------------------------------
. 
. * Set general graph style
. set scheme swift_red // select one scheme as reference scheme to work with

. 
. 
. grstyle init 

. {
. *Background color
. grstyle set color white: background plotregion graphregion legend box textbox //
. 
. *Main colors (note: swift_red only defines 8 colors. Multiplying the color, that is "xx yy z
> z*0.5" reduces/increases intensity and "xx yy zz%50" reduces transparency)
. grstyle set color       "100 143 255" "120 94 240" "220 38 127" "254 97 0" "255 176 0" /// 5
>  main colors
>                                         "100 143 255*0.4" "120 94 240*0.4" "220 38 127*0.4" 
> "254 97 0*0.4" "255 176 0*0.4" ///
>                                         "100 143 255*1.7" "120 94 240*1.7" "220 38 127*1.7" 
> "254 97 0*1.7" "255 176 0*1.7" ///
>                                         : p# p#line p#lineplot p#bar p#area p#arealine p#pie
>  histogram 
. 
. *margins
. grstyle set compact
. 
. *Font size
. grstyle set size 10pt: heading //titles
. grstyle set size 8pt: subheading axis_title //axis titles
. grstyle set size 8pt: p#label p#boxlabel body small_body text_option axis_label tick_label m
> inortick_label key_label //all other text
. 
. }

. * -------------------------------------------------
. 
. 
. *--------------------------------------------------
. * Run processing and analysis scripts
. *--------------------------------------------------
. do "$working_ANALYSIS\scripts\01 - clean.do"

. *-----------------
. *   Cleaning & Generating
. *-----------------
. 
. use "$working_ANALYSIS\data\delegates_raw.dta", clear

. 
. *---------
. *   Generating variables
. *----------
. 
. // Sociodemographics
. * Binary variables for education categories
. tab edu, generate(edu)

     Field in which |
  highes degree was |
           obtained |      Freq.     Percent        Cum.
--------------------+-----------------------------------
    Natural Science |        126       45.49       45.49
     Social Science |         55       19.86       65.34
Mix: Social&Natural |         47       16.97       82.31
                Law |         26        9.39       91.70
              Other |         23        8.30      100.00
--------------------+-----------------------------------
              Total |        277      100.00

. 
. * Organization currently working for
. gen orga = .
(277 missing values generated)

. replace orga = 1 if organization == 1 | organization == 2 // International (11) & national (
> 168) gov orga 
(179 real changes made)

. replace orga = 2 if organization == 3 //  University/Research Institute
(33 real changes made)

. replace orga = 3 if organization == 5 //  Environmental NGO
(25 real changes made)

. replace orga = 4 if organization == 4 |  organization == 6 |  organization == 7 //  Private 
> Company (n=8), Non-environmental NGO (n=6), Other (n=26)
(40 real changes made)

. tab organization

         Type of organization |
        currently working for |      Freq.     Percent        Cum.
------------------------------+-----------------------------------
  Internat. Gov. Organization |         11        3.97        3.97
       Nat. Gov. Organization |        168       60.65       64.62
University/Research Institute |         33       11.91       76.53
              Private Company |          8        2.89       79.42
            Environmental NGO |         25        9.03       88.45
        Non-Environmental NGO |          6        2.17       90.61
                        Other |         26        9.39      100.00
------------------------------+-----------------------------------
                        Total |        277      100.00

. lab define orga_lab 1 "Governmental Organization" 2 "University/Research Institute" 3 "Envir
> onmental NGO" 4 "Other"

. lab val orga orga_lab

. tab orga, gen(orga)

                         orga |      Freq.     Percent        Cum.
------------------------------+-----------------------------------
    Governmental Organization |        179       64.62       64.62
University/Research Institute |         33       11.91       76.53
            Environmental NGO |         25        9.03       85.56
                        Other |         40       14.44      100.00
------------------------------+-----------------------------------
                        Total |        277      100.00

. 
. 
. 
. // Temperature rise deemed acceptable
. * Binary variable being 1 if temperature rise above 1.5 degrees is deemed acceptable and 0 o
> therwise
. gen temp_above = .
(277 missing values generated)

. replace temp_above = 0 if temp_rise <= 1.5
(216 real changes made)

. replace temp_above = 1 if temp_rise > 1.5
(61 real changes made)

. lab var temp_above "Temperature rise above 1.5°C deemed acceptable"

. 
. * Cropped temperature rise deemed acceptable
. /*
> Very few people suggested temperatures of 2.5°C or higher to be acceptable:
> 2.5°C -> 9
> 3.0°C -> 4
> 3.5°C -> 2
> 4.0°C -> 2
> 4.5°C -> 0
> 5.0°C -> 4
> Therefore, for the illustration Figure 1a all temperature suggestions of 2.5°C or more are s
> ummarized under >= 2.5°C
> */
. gen temp_rise2 = temp_rise

. replace temp_rise2 = 2.5 if temp_rise >= 2.5
(12 real changes made)

. tostring temp_rise2, gen(temp_rise3)
temp_rise3 generated as str3

. sort temp_rise

. lab define temp 1 "0" 2 ".5" 3 "1" 4 "1.5", replace

. encode temp_rise3, gen(temp_rise_cropped) lab(temp)

. lab var temp_rise_cropped"All those suggesting 2.5 or more collected in 2.5"

. drop temp_rise2 temp_rise3

. 
. 
. 
. 
. 
. // Global carbon price suggested
. * Logarithmic form of suggested carbon prices
. gen ln_carbon_price = ln(carbon_price + 1)

. label var ln_carbon_price "Natural logarithm of suggested carbon_price"

. 
. * Cropping global carbon price suggested at USD500 for visualization in figure 1b
. gen carbon_price_cap = carbon_price

. replace carbon_price_cap  = 501 if carbon_price > 500
(23 real changes made)

. lab var carbon_price_cap "Carbon price capped at USD500"

. egen mean_carbon_price = mean(carbon_price), by(temp_rise_cropped)

. lab var mean_carbon_price "Mean carbon price (non-capped)"

. egen median_carbon_price = median(carbon_price), by(temp_rise_cropped)

. lab var median_carbon_price "Median carbon price (non-capped)"

. tab temp_rise_cropped , gen(tr)

  All those |
 suggesting |
2.5 or more |
  collected |
     in 2.5 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         22        7.94        7.94
         .5 |         36       13.00       20.94
          1 |         42       15.16       36.10
        1.5 |        116       41.88       77.98
          2 |         40       14.44       92.42
        2.5 |         21        7.58      100.00
------------+-----------------------------------
      Total |        277      100.00

. 
. 
. * Cropping area-specific carbon prices at USD500 for visualization in figure 1c
. foreach var in price_home_now price_oecd_now price_ldc_now price_home_future price_oecd_futu
> re price_ldc_future ln_carbon_price {
  2. gen `var'_cap = `var'
  3. replace `var'_cap  = 501 if `var' > 500
  4. lab var `var'_cap "Carbon price capped at USD500"
  5. egen mean_`var' = mean(`var')
  6. lab var mean_`var' "Mean carbon price (non-capped)"
  7. egen median_`var' = median(`var')
  8. lab var median_`var' "Median carbon price (non-capped)"
  9. }
(13 real changes made)
(23 real changes made)
(11 real changes made)
(25 real changes made)
(36 real changes made)
(23 real changes made)
(0 real changes made)

. 
. 
. * Binary variable being 1 if global carbon price below 60 USD suggested
. gen price_below = .
(277 missing values generated)

. replace price_below = 0 if carbon_price >= 60 
(126 real changes made)

. replace price_below = 1 if carbon_price < 60 
(151 real changes made)

. lab var price_below "Price suggested < USD60"

. 
. * Binary variable being 1 if national carbon prices (now & future) below 60 USD suggested
. foreach var in now future {
  2.         gen price_below_home_`var' = .
  3.         replace price_below_home_`var' = 0 if price_home_`var' >= 60
  4.         replace price_below_home_`var' = 1 if price_home_`var' < 60
  5.         lab var price_below_home_`var' "Price suggested < USD60"
  6.         }
(277 missing values generated)
(79 real changes made)
(198 real changes made)
(277 missing values generated)
(126 real changes made)
(151 real changes made)

. 
. 
. /*
> Carbon price suggestions tested
> Different models suggest different minimal global carbon prices to stay below a certain temp
> erature rise. In the main paper we use USD60 as thte threshold. As robustness test, we also 
> test against other specifications: 37 USD 82 USD, 185 USD, 281 USD
> */
. foreach i in 37 60 82 185 281 {
  2.         gen price_below_`i' = .
  3.                 replace price_below_`i'= 1 if carbon_price < `i'
  4.                 replace price_below_`i'= 0 if carbon_price >=  `i'
  5.         lab var price_below_`i' "Price below USD `i' suggested"
  6. }
(277 missing values generated)
(119 real changes made)
(158 real changes made)
(277 missing values generated)
(151 real changes made)
(126 real changes made)
(277 missing values generated)
(175 real changes made)
(102 real changes made)
(277 missing values generated)
(224 real changes made)
(53 real changes made)
(277 missing values generated)
(241 real changes made)
(36 real changes made)

. 
. 
. * National carbon price (now)
. foreach i in 37 60 82 185 281 {
  2.         gen price_now_below_`i' = .
  3.                 replace price_now_below_`i'= 1 if price_home_now < `i'
  4.                 replace price_now_below_`i'= 0 if price_home_now >=  `i'
  5.         lab var price_now_below_`i' "National price now below USD `i' suggested"
  6. }
(277 missing values generated)
(159 real changes made)
(118 real changes made)
(277 missing values generated)
(198 real changes made)
(79 real changes made)
(277 missing values generated)
(215 real changes made)
(62 real changes made)
(277 missing values generated)
(250 real changes made)
(27 real changes made)
(277 missing values generated)
(257 real changes made)
(20 real changes made)

. 
. 
. * National carbon price (future)
. foreach i in 37 60 82 185 281 {
  2.         gen price_future_below_`i' = .
  3.                 replace price_future_below_`i'= 1 if price_home_future < `i'
  4.                 replace price_future_below_`i'= 0 if price_home_future >=  `i'
  5.         lab var price_future_below_`i' "National price future below USD `i' suggested"
  6. }
(277 missing values generated)
(110 real changes made)
(167 real changes made)
(277 missing values generated)
(151 real changes made)
(126 real changes made)
(277 missing values generated)
(167 real changes made)
(110 real changes made)
(277 missing values generated)
(210 real changes made)
(67 real changes made)
(277 missing values generated)
(234 real changes made)
(43 real changes made)

. 
. 
. 
. 
. // Region- and time-specific carbon price suggestions
. ** Logarithms of prices suggested prices for home, OECD, LDC / now, future
. foreach var in price_home_now price_oecd_now price_ldc_now price_home_future price_oecd_futu
> re price_ldc_future {
  2. gen ln_`var' = log(`var' + 1)
  3. }

. lab var ln_price_home_now "Ln of Price Home Now"

. lab var ln_price_oecd_now "Ln of Price OECD Now"

. lab var ln_price_ldc_now "Ln of Price LDCs Now"

. lab var ln_price_home_future "Ln of Price Home Future"

. lab var ln_price_oecd_future "Ln of Price OECD Future"

. lab var ln_price_ldc_future "Ln of Price LDCs Future"

. 
. 
. 
. * Average carbon price
. alpha carbon_price carbon_price price_home_now price_oecd_now price_ldc_now price_home_futur
> e price_oecd_future price_ldc_future, gen(carbon_price_mean)

Test scale = mean(unstandardized items)

Average interitem covariance:     93673.63
Number of items in the scale:            7
Scale reliability coefficient:      0.9287

. 
. * Average carbon price (log)
. alpha ln_carbon_price ln_carbon_price ln_price_home_now ln_price_oecd_now ln_price_ldc_now l
> n_price_home_future ln_price_oecd_future ln_price_ldc_future, gen(ln_carbon_price_mean)

Test scale = mean(unstandardized items)

Average interitem covariance:     2.065777
Number of items in the scale:            7
Scale reliability coefficient:      0.9486

. 
. 
. 
. 
. 
. 
. 
. 
. // Principal components
. ** Technological optimism
. pca tech_ms_1 tech_ms_2 tech_ms_3 tech_ms_4 tech_ms_5

Principal components/correlation                 Number of obs    =        277
                                                 Number of comp.  =          5
                                                 Trace            =          5
    Rotation: (unrotated = principal)            Rho              =     1.0000

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |      2.17475      1.22935             0.4350       0.4350
           Comp2 |      .945404      .168293             0.1891       0.6240
           Comp3 |      .777111       .21128             0.1554       0.7795
           Comp4 |      .565831     .0289289             0.1132       0.8926
           Comp5 |      .536902            .             0.1074       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors) 

    ------------------------------------------------------------------------------
        Variable |    Comp1     Comp2     Comp3     Comp4     Comp5 | Unexplained 
    -------------+--------------------------------------------------+-------------
       tech_ms_1 |   0.4607    0.4038   -0.4509    0.0014    0.6491 |           0 
       tech_ms_2 |   0.5108    0.0330   -0.3453   -0.4817   -0.6219 |           0 
       tech_ms_3 |   0.4410   -0.5503   -0.1772    0.6799   -0.0953 |           0 
       tech_ms_4 |   0.3815    0.5906    0.5725    0.3459   -0.2412 |           0 
       tech_ms_5 |   0.4322   -0.4293    0.5641   -0.4313    0.3531 |           0 
    ------------------------------------------------------------------------------

. predict tech_ms_pca
(score assumed)
(4 components skipped)

Scoring coefficients 
    sum of squares(column-loading) = 1

    ----------------------------------------------------------------
        Variable |    Comp1     Comp2     Comp3     Comp4     Comp5 
    -------------+--------------------------------------------------
       tech_ms_1 |   0.4607    0.4038   -0.4509    0.0014    0.6491 
       tech_ms_2 |   0.5108    0.0330   -0.3453   -0.4817   -0.6219 
       tech_ms_3 |   0.4410   -0.5503   -0.1772    0.6799   -0.0953 
       tech_ms_4 |   0.3815    0.5906    0.5725    0.3459   -0.2412 
       tech_ms_5 |   0.4322   -0.4293    0.5641   -0.4313    0.3531 
    ----------------------------------------------------------------

. lab var tech_ms_pca "Technological optimism mindset (PCA)"

. 
. * Winsorized variable of technological optimism (used for robustness test)
. winsor2 tech_ms_pca, suffix(_win) cuts(5 95)

. 
. 
. 
. 
. 
. *--- SAVE ---*
. save "$working_ANALYSIS\data\delegates_analysis.dta", replace
file C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_S
> ubmission\replication_delegates\data\delegates_analysis.dta saved

. 
. 
. 
. 
. 
. 
. 
. 
end of do-file

. do "$working_ANALYSIS\scripts\02 - analysis.do"

. *--------------------------------------------------
. * Analysis 
. *-------------------------------------------------
. 
. 
. 
. *********************************************************
. **********               STRUCTURE             **********
. *********************************************************
. /*
> 
> I) Fig. 1. Technological optimism, temperature rise deemed acceptable, and carbon prices
> 
> II) In text-statistics not mentioned in the supplementary online material
>     - "Delegates vastly agree to limit global warming: The majority perceives a rise above 1
> .5°C unacceptable (78%), with only few (8%) deeming an increase of 2.5°C or more acceptable.
> "
>     - "The median global carbon price recommended in our sample is 50 USD [...]"
>     - "Roughly half of all delegates interviewed stated rather unambitious carbon prices bel
> ow 60 USD (55%). Only 37% (19% and 13%, respectively) deemed a price of at least 82 USD (185
>  USD, 281 USD) as appropriate"
>     - "This variance in global price suggested is highest for the three low temperature opti
> ons (0°C, 0.5°C and 1°C), with price suggestions ranging from 0 to 2,000 USD (Levene’s test 
> F(1, 275)=21.7, p<0.001)."
>     - "Of the 100 delegates [suggesting prices between 0°C und 1°C] in favor of these ambiti
> ous temperature targets, 62% indicated global carbon prices below 60 USD as appropriate to s
> tay below the temperature target."
>     - "In addition, we find that participants who claim to be influential in their delegatio
> n score higher on the technological optimism mindset (r=.23, p<.001)."
> */
. 
. 
. 
. 
. *---------------------------------------
. *   I) FIGURE 1 
. *------------------------------
. // Figure Settings
. * Text size
. global head     10 // Title

. global legend    8 // Legend

. global xytitle   8 // Axis title

. global xylab     8 // Scale label

. global fysize    22 

. global textsize  14 pt

. 
. 
. 
. // Fig 1a: Distribution of answers towards technological optimism items
. ** Catplot for each item
. global margins 145 0 1 3 // set margins for all

. global pos_text1 -15 50

. global pos_text2  50 -4

. 
. mylabels 0(25)100, myscale(@) local(pctlabel) suffix("%") // set label for axis
0 "0%" 25 "25%" 50 "50%" 75 "75%" 100 "100%"

. catplot tech_ms_1 , text($pos_text1 "Future generations will be richer and better equipped t
> o deal" "with adverse impacts of climate change." $pos_text2 "{it:.46}", size($textsize) pla
> ce(w) just(right)) stack percent asyvar yla(`pctlabel', nogrid)  title("") bargap(0) blabel(
> bar, size(medium) format(%9.0f) pos(center)) l1title("")  b1title("") legend(rows(1) pos(6) 
> ring(1) size(vsmall)) plotregion(margin(zero)) graphregion(margin($margins)) yscale(off) fys
> ize($fysize)

. graph save "$working_ANALYSIS\results\intermediate\fut_opt1", replace
(file C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_
> Submission\replication_delegates\results\intermediate\fut_opt1.gph saved)

. catplot tech_ms_2 , text($pos_text1  "Technological innovation e.g., solar geoengineering of
> fers" "a suitable solution to respond in case of a future climate emergency." $pos_text2 "{i
> t:.51}", size($textsize) place(w) just(right)) stack percent asyvar yla(`pctlabel', nogrid) 
>  title("") bargap(0) blabel(bar, size(medium) format(%9.0f) pos(center)) l1title("")  b1titl
> e("") legend(rows(1) pos(6) ring(1) size(vsmall)) plotregion(margin(zero)) graphregion(margi
> n($margins)) yscale(off) fysize($fysize)

. graph save "$working_ANALYSIS\results\intermediate\fut_opt2", replace
(file C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_
> Submission\replication_delegates\results\intermediate\fut_opt2.gph saved)

. catplot tech_ms_3 , text($pos_text1  "The present costs and future benefits to society must 
> be weighed" "against each other, while deciding about emission reduction policies." $pos_tex
> t2 "{it:.44}", size($textsize) place(w) just(right)) stack percent asyvar yla(`pctlabel', no
> grid)  title("") bargap(0) blabel(bar, size(medium) format(%9.0f) pos(center)) l1title("")  
> b1title("") legend(rows(1) pos(6) ring(1) size(vsmall)) plotregion(margin(zero)) graphregion
> (margin($margins)) yscale(off) fysize($fysize)

. graph save "$working_ANALYSIS\results\intermediate\fut_opt3", replace
(file C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_
> Submission\replication_delegates\results\intermediate\fut_opt3.gph saved)

. 
. catplot tech_ms_5 , text($pos_text1 "Transformation towards a sustainable society is possibl
> e by making" "productions more resourcesaving and without harming the economy." $pos_text2 "
> {it:.43}" 180 2 "{it:Loading}" "{it:(PCA)}", size($textsize) place(w) just(right)) stack per
> cent asyvar yla(`pctlabel', nogrid)  title("") bargap(0) blabel(bar, size(medium) format(%9.
> 0f) pos(center)) l1title("")  b1title("") legend(rows(3) pos(6) ring(1) size(7.5 pt) rowgap(
> minuscule) symxsize(2.5)) plotregion(margin(zero)) graphregion(margin($margins)) yscale(off)
>  fysize($fysize)

. graph save "$working_ANALYSIS\results\intermediate\fut_opt6", replace
(file C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_
> Submission\replication_delegates\results\intermediate\fut_opt6.gph saved)

. 
. catplot tech_ms_4 , text($pos_text1 "Technological innovations for climate change emerge mor
> e likely in a" "free-market economy without much interference from the Government." $pos_tex
> t2 "{it:.38}", size($textsize) place(w) just(right)) stack percent asyvar yla(`pctlabel', no
> grid labsize(relative3)) ytitle("percent", size(relative3)) title("") bargap(0) blabel(bar, 
> size(medium) format(%9.0f) pos(center)) l1title("")  b1title("") legend(rows(3) pos(6) ring(
> 1) size(7.5 pt) symxsize(2.5)) plotregion(margin(zero)) graphregion(margin($margins)) fysize
> (46)

. graph save "$working_ANALYSIS\results\intermediate\fut_opt5", replace
(file C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_
> Submission\replication_delegates\results\intermediate\fut_opt5.gph saved)

. 
. * Combine the single plots
. grc1leg "$working_ANALYSIS\results\intermediate\fut_opt6" "$working_ANALYSIS\results\interme
> diate\fut_opt3" "$working_ANALYSIS\results\intermediate\fut_opt2" "$working_ANALYSIS\results
> \intermediate\fut_opt1" "$working_ANALYSIS\results\intermediate\fut_opt5" , cols(1) legendfr
> om("$working_ANALYSIS\results\intermediate\fut_opt6") title("{bf:a }", size(11 pt) pos(11) r
> ing(15)) graphregion(margin(2 3 -3 0)) plotregion(margin(0 0 0 0)) 

. gr_edit .legend.plotregion1.DragBy 1 35

. gr_edit .plotregion1.graph1.plotregion1.textbox3.style.editstyle horizontal(center) editcopy

. gr_edit .plotregion1.graph1.plotregion1.textbox3.style.editstyle size(13) editcopy

. gr_edit .plotregion1.graph1.plotregion1.textbox2.style.editstyle size(13) editcopy

. gr_edit .plotregion1.graph2.plotregion1.textbox2.style.editstyle size(13) editcopy

. gr_edit .plotregion1.graph3.plotregion1.textbox2.style.editstyle size(13) editcopy

. gr_edit .plotregion1.graph4.plotregion1.textbox2.style.editstyle size(13) editcopy

. gr_edit .plotregion1.graph5.plotregion1.textbox2.style.editstyle size(13) editcopy

. graph save "$working_ANALYSIS\results\intermediate\tech_opt_answers", replace
(file C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_
> Submission\replication_delegates\results\intermediate\tech_opt_answers.gph saved)

. graph export "$working_ANALYSIS\results\intermediate\1a_tech_opt_answers.tif", replace
(file C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_
> Submission\replication_delegates\results\intermediate\1a_tech_opt_answers.tif written in TIF
> F format)

. 
. 
. 
. 
. 
. // Fig 1b
. ** Global carbon price and temperature rise 
. * Global Generate variable defining position of observations on x-axis
. egen carbon_price_rank = rank(carbon_price_cap), by(temp_rise_cropped) unique

. egen temp_rise_cropped_freq = count(carbon_price_cap), by(temp_rise_cropped)

. gen  temp_rise_cropped_jitter2 = temp_rise_cropped + (carbon_price_rank *.006) - (temp_rise_
> cropped_freq / 2 * 0.006)

. 
. * National: Generate variable defining position of observations on x-axis
. foreach var in now future {
  2. egen price_rank_h_`var' = rank(price_home_`var'_cap), unique
  3. }

. 
. gen h_now_jitter = .
(277 missing values generated)

. replace h_now_jitter = .5 + (price_rank_h_now *.001)
(277 real changes made)

. gen h_future_jitter = .
(277 missing values generated)

. replace h_future_jitter = 1 + (price_rank_h_future * .001)
(277 real changes made)

. gen h_now_stat = .
(277 missing values generated)

. replace h_now_stat = .6
(277 real changes made)

. gen h_future_stat = .
(277 missing values generated)

. replace h_future_stat = 1.1
(277 real changes made)

. 
. 
. * Save number of observations in locals
. forvalues i = 1/6 {
  2. sum ln_carbon_price if tr`i' == 1
  3. local n_`i' = r(N)
  4. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
ln_carbon_~e |         22    3.323065    2.261287          0   7.601402

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
ln_carbon_~e |         36    3.722019    2.127395   .6931472   7.601402

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
ln_carbon_~e |         42    4.207788    1.800718   1.098612   7.601402

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
ln_carbon_~e |        116    4.121002    1.359837          0   7.313887

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
ln_carbon_~e |         40    3.659859    1.407166          0   6.552508

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
ln_carbon_~e |         21    3.544467    1.325008   .6931472   6.908755

. twoway ///
> (scatter carbon_price_cap temp_rise_cropped_jitter2 , mcolor(%30) msize(medium) msymbol(o)) 
> ///
> (scatter mean_carbon_price temp_rise_cropped , mcolor("119 94 239") mlcolor("94 64 201")  ml
> width(medium) msymbol(triangle))                           ///
> (scatter median_carbon_price temp_rise_cropped , mcolor("220 38 127") mlcolor("208 17 111") 
>  mlwidth(medium) msymbol(square))                           ///
> , title("{bf:b }", pos(11) span size($head pt))                                             
> ///
> ytitle("Global carbon price to stay below" "stated temperat. target (USD/tCO2)", size($xytit
> le pt))                               ///
> ylabel(, labsize($xylab pt))                                                                
> ///
> xtitle("Temperature rise deemed acceptable (°C)", size($xytitle pt)  margin(0 0 0 4))       
> ///
> xlabel(1 `" "0°C" "(n=`n_1')" "' 2 `" "0.5°C" "(n=`n_2')" "'  3 `" "1°C" "(n=`n_3')" "' 4 `"
>  "1.5°C" "(n=`n_4')" "' 5 `" "2°C" "(n=`n_5')" "' 6 `" "{&ge}2.5°C" "(n=`n_6')" "' , labsize
> (2.1 pt))                                         ///
> xscale(range(0.85 6.2 )) ///
> legend(order(1 "Observation" 2 "Mean" 3 "Median") size($legend pt) rows(1) pos(6) ring(1) re
> gion(fcolor(%40))) ///
> fysize(45) fxsize(40) scale(*1.25) graphregion(margin(0 0 1.3 0) fcolor(none) lcolor(none)) 
> plotregion(margin(0 0 0 0)) 

. graph save "$working_ANALYSIS\results\intermediate\price_temprise", replace
(file C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_
> Submission\replication_delegates\results\intermediate\price_temprise.gph saved)

. 
. 
. * National carbon prices home (now/future)
. twoway ///
> (scatter price_home_now_cap h_now_jitter , mcolor(purple%30) msize(medium) msymbol(o))  ///
> (scatter mean_price_home_now h_now_stat , mcolor("119 94 239") mlcolor("94 64 201")  mlwidth
> (medium) msymbol(triangle))                    ///
> (scatter median_price_home_now h_now_stat , mcolor("220 38 127") mlcolor("208 17 111")  mlwi
> dth(medium) msymbol(square))                        ///
> (scatter price_home_future_cap h_future_jitter , mcolor(orange%30) msize(medium) msymbol(o))
>  ///
> (scatter mean_price_home_future h_future_stat , mcolor("119 94 239") mlcolor("94 64 201")  m
> lwidth(medium) msymbol(triangle))                  ///
> (scatter median_price_home_future h_future_stat , mcolor("220 38 127") mlcolor("208 17 111")
>   mlwidth(medium) msymbol(square))                  ///
> , title("{bf: }", pos(11) span size($head pt))                                   ///
> ytitle("National carbon price to stay below" "2°C temp. target (USD/tCO2)", size($xytitle pt
> ))            ///
> ylabel(, labsize($xylab pt)) yscale(alt) ///
> xtitle("Time period", size($xytitle pt)  margin(0 0 0 4)) ///
> xlabel(.6 "Now" 1.1 "Future", labsize(8 pt)) xscale(range(0.47 1.3)) ///
> legend(off) ///
> fysize(45) fxsize(20) scale(*1.25) graphregion(margin(6 0 13.3 3.6) fcolor(none) lcolor(none
> )) plotregion(margin(0 0 0 0)) nodraw

. graph save "$working_ANALYSIS\results\intermediate\global_price", replace
(file C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_
> Submission\replication_delegates\results\intermediate\global_price.gph saved)

. 
. 
. 
. 
. 
. 
. 
. // Fig. 1c. Marginsplot global carbon price and home carbon price deemed necessary 
. * Set globals
. global info_source info_cc_1 info_cc_2 info_cc_3 info_cc_4 info_cc_5

. global socioeconomics edu1 edu3 edu4 edu5 // Education ref. cat.: edu2 (Social Sciences); ge
> nder and age erased to not jepardize anonimity of participants

. global orga orga2 orga3 orga4 // Governmental organization ref. cat.

. global countryspecifics lower_middle_income upper_middle_income high_income // Income level:
>  ref.cat: low; country-level erased to not jepardize anonimity of participants

. 
. 
. * Probit, DV: Global carbon price 
. quietly: probit price_below temp_above tech_ms_pca $info_source $orga cops_attended $socioec
> onomics $countryspecifics treat_tech, vce(robust)

. eststo p1: margins, dydx(tech_ms_pca) post

Average marginal effects                        Number of obs     =        277
Model VCE    : Robust

Expression   : Pr(price_below), predict()
dy/dx w.r.t. : tech_ms_pca

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 tech_ms_pca |   .0608695   .0201929     3.01   0.003     .0212922    .1004468
------------------------------------------------------------------------------

. 
. * Probit, DV: Carbon price home now
. quietly: probit price_below_home_now temp_above tech_ms_pca $info_source $orga cops_attended
>  $socioeconomics $countryspecifics treat_tech, vce(robust)

. eststo p2: margins, dydx(tech_ms_pca) post

Average marginal effects                        Number of obs     =        277
Model VCE    : Robust

Expression   : Pr(price_below_home_now), predict()
dy/dx w.r.t. : tech_ms_pca

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 tech_ms_pca |   .0584347   .0172571     3.39   0.001     .0246114    .0922579
------------------------------------------------------------------------------

. 
. * Probit, DV: Carbon price home now
. quietly: probit price_below_home_future temp_above tech_ms_pca $info_source $orga cops_atten
> ded $socioeconomics $countryspecifics treat_tech, vce(robust)

. eststo p3: margins, dydx(tech_ms_pca) post

Average marginal effects                        Number of obs     =        277
Model VCE    : Robust

Expression   : Pr(price_below_home_future), predict()
dy/dx w.r.t. : tech_ms_pca

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 tech_ms_pca |   .0446668   .0204371     2.19   0.029     .0046108    .0847228
------------------------------------------------------------------------------

. 
. * Marginsplot
. coefplot(p1, offset(-0.3)) (p2, offset(0)) (p3, offset(.3)), legend(order(3 "Average margina
> l effect" 1 "95% Confidence interval" 2 "90% Confidence interval") size($legend pt) rows(3) 
> rowgap(tiny) pos(6) ring(1) region(fcolor(%40))) title("{bf:c} ", pos(11) span size($head pt
> ))  byopts(compact rows(1)) yline(0, lpattern(dash) lcolor(gs3)) ylabel(-.02(.02).1, labsize
> ($xylab pt)) xlab(.7 "Global" 1 "National now" 1.3 "National future", labsize($xylab pt)) yt
> itle("Estimated impact: Tech. optimism" "and proposing carbon price < 60USD", size($xytitle 
> pt)) grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond
> (@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) ml
> absize(10pt) mlabposition(2) subtitle(, size(9pt) lstyle(none) margin(small) nobox justifica
> tion(center) alignment(top) bmargin(top)) vertical graphregion(margin(15 2 0 0) fcolor(none)
>  lcolor(none)) plotregion(margin(0 0 0 0)) scale(*1.25) fysize(80) 
(note:  named style thin not found in class linestyle, default attributes used)

. graph save "$working_ANALYSIS\results\intermediate\margins_temp_price", replace 
(file C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_
> Submission\replication_delegates\results\intermediate\margins_temp_price.gph saved)

. 
. 
. 
. 
. // Combine graph b & c
. graph combine "$working_ANALYSIS\results\intermediate\price_temprise" "$working_ANALYSIS/res
> ults/intermediate/global_price.gph" "$working_ANALYSIS\results\intermediate\margins_temp_pri
> ce", rows(1) fysize(50)
(note:  named style thin not found in class linestyle, default attributes used)

. gr save "$working_ANALYSIS/results/intermediate/figure1_bc.gph", replace
(file C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_
> Submission\replication_delegates/results/intermediate/figure1_bc.gph saved)

. 
. // Combine graph a with b&c
. graph combine "$working_ANALYSIS\results\intermediate\tech_opt_answers" "$working_ANALYSIS/r
> esults/intermediate/figure1_bc.gph" , rows(2) ysize(5) graphregion(margin(b=0))
(note:  named style thin not found in class linestyle, default attributes used)

. 
. gr_edit plotregion1.graph2.plotregion1.graph1.yaxis1.title.DragBy 0 -1.6     // Graph B: rep
> osition y-axis title 

. gr_edit plotregion1.graph2.plotregion1.graph2.xaxis1.title.DragBy 0.75 0      // Graph B: re
> position x-axis title

. gr_edit plotregion1.graph2.plotregion1.graph1.legend.plotregion1.DragBy 0 9  // Graph B: rep
> osition legend

. 
. gr_edit plotregion1.graph2.plotregion1.graph3.legend.plotregion1.key[1].DragBy -1 0   // Gra
> ph C: Legend key 1 

. gr_edit plotregion1.graph2.plotregion1.graph3.legend.plotregion1.label[1].DragBy -1 0 // Gra
> ph C: Legend label 1

. gr_edit plotregion1.graph2.plotregion1.graph3.legend.plotregion1.key[3].DragBy 1 0    // Gra
> ph C: Legend key 3

. gr_edit plotregion1.graph2.plotregion1.graph3.legend.plotregion1.label[3].DragBy 1 0  // Gra
> ph C: Legend label 3

. gr_edit plotregion1.graph2.plotregion1.graph3.legend.DragBy 1 0 // Graph C: Legend Move

. 
. gr_edit plotregion1.graph2.plotregion1.graph3.xaxis1.major.num_rule_ticks = 0

. gr_edit plotregion1.graph2.plotregion1.graph3.xaxis1.edit_tick 1 0.7 `"Global"', tickset(maj
> or) editstyle(tickstyle(textstyle(size(8 pt))))

. gr_edit plotregion1.graph2.plotregion1.graph3.xaxis1.major.num_rule_ticks = 0

. gr_edit plotregion1.graph2.plotregion1.graph3.xaxis1.edit_tick 2 1 `""National" "now""', tic
> kset(major) editstyle(tickstyle(textstyle(size(2.3))))

. gr_edit plotregion1.graph2.plotregion1.graph3.xaxis1.major.num_rule_ticks = 0

. gr_edit plotregion1.graph2.plotregion1.graph3.xaxis1.edit_tick 3 1.3 `""National" "future""'
> , custom tickset(major) editstyle(tickstyle(textstyle(size(2.3))))

. gr_edit plotregion1.graph2.plotregion1.graph3.yoffset = -1.6                 // Graph C: off
> set y

. gr_edit plotregion1.graph2.plotregion1.graph3.plotregion1.plot8.style.editstyle area(linesty
> le(color("255 220 184"))) editcopy

. gr_edit plotregion1.graph2.plotregion1.graph3.plotregion1.plot7.style.editstyle area(linesty
> le(color("255 128 0"))) editcopy

. gr_edit plotregion1.graph2.plotregion1.graph3.plotregion1.plot9.style.editstyle marker(fillc
> olor("255 128 0")) editcopy

. 
. gr save "$working_ANALYSIS/results/intermediate/Figure 1", replace
(file C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_
> Submission\replication_delegates/results/intermediate/Figure 1.gph saved)

. gr export "$working_ANALYSIS/results/figures/Figure 1.tif", replace width(4000)
(file C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_
> Submission\replication_delegates/results/figures/Figure 1.tif written in TIFF format)

. gr export "$working_ANALYSIS/results/figures/Figure 1.eps", replace
(file C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_
> Submission\replication_delegates/results/figures/Figure 1.eps written in EPS format)

. 
. 
. 
. 
. 
. 
. *---------------------------------------
. *   III) In text-statistics not mentioned in the supplementary online material
. *------------------------------
. // Second, delegates vastly agree to limit global warming: The majority perceives a rise abo
> ve 1.5°C unacceptable (78%), with only few (8%) deeming an increase of 2.5°C or more accepta
> ble (Figure 1b). 
. tab temp_rise

 Acceptable |
increase in |
temperature |
 until 2100 |
compared to |
pre-industr |
 ial levels |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         22        7.94        7.94
         .5 |         36       13.00       20.94
          1 |         42       15.16       36.10
        1.5 |        116       41.88       77.98
          2 |         40       14.44       92.42
        2.5 |          9        3.25       95.67
          3 |          4        1.44       97.11
        3.5 |          2        0.72       97.83
          4 |          2        0.72       98.56
          5 |          4        1.44      100.00
------------+-----------------------------------
      Total |        277      100.00

. 
. // "Roughly half of all delegates interviewed stated rather unambitious carbon prices below 
> 60 USD (55%). Only 37% (19% and 13%, respectively) deemed a price of at least 82 USD (185 US
> D, 281 USD) as appropriate"
. sum price_below_60 price_below_82 price_below_185 price_below_281

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
price_bel~60 |        277    .5451264    .4988607          0          1
price_bel~82 |        277     .631769    .4831975          0          1
price_be~185 |        277    .8086643    .3940647          0          1
price_be~281 |        277    .8700361    .3368723          0          1

. 
. // "The median global carbon price recommended in our sample is 50 USD [...]"
. sum carbon_price, d

     Appropriate price for carbon emissions (US$/t CO2)
                   to stay below temp_rise
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            2              0
10%            7              0       Obs                 277
25%           15              0       Sum of Wgt.         277

50%           50                      Mean            189.574
                        Largest       Std. Dev.      412.4805
75%          100           2000
90%          500           2000       Variance       170140.2
95%         1002           2000       Skewness       3.322374
99%         2000           2000       Kurtosis       13.51885

. 
. // "The median national carbon prices in the delegates’ home country are set rather low at 2
> 5 USD and 50 USD for the present (today-2030) and future (2080-2100) respectively."
. sum price_home_now price_home_future, d

     Home: Appropriate price for carbon emissions until
                2030 to keep temeprature belo
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            2              0       Obs                 277
25%           10              0       Sum of Wgt.         277

50%           25                      Mean           107.0289
                        Largest       Std. Dev.      293.6312
75%           77           2000
90%          175           2000       Variance       86219.26
95%          500           2000       Skewness       4.916304
99%         2000           2000       Kurtosis       28.83314

      Home: Appropriate price for carbon emissions from
               2080 to 2100 to keep temepratu
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            5              0       Obs                 277
25%           15              0       Sum of Wgt.         277

50%           50                      Mean            201.935
                        Largest       Std. Dev.       406.729
75%          150           2000
90%          500           2000       Variance       165428.5
95%         1300           2000       Skewness       3.116028
99%         2000           2000       Kurtosis       12.40012

. 
. // "Respondents with higher technological optimism showed a significant preference for recom
> mending the book advocating for incremental changes based on efficiency to address ecologica
> l problems (“More from Less” by Andrew McAfee), while being less likely to suggest the alter
> native which calls for transformative solutions and re-thinking our economies"
. ttest tech_ms_pca, by(book2) // More from less

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     197   -.1587187    .1070368    1.502333   -.3698103     .052373
       1 |      80    .3908448    .1491937    1.334429     .093882    .6878075
---------+--------------------------------------------------------------------
combined |     277    1.99e-09    .0886064    1.474704   -.1744302    .1744302
---------+--------------------------------------------------------------------
    diff |           -.5495634    .1930402               -.9295877   -.1695392
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -2.8469
Ho: diff = 0                                     degrees of freedom =      275

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0024         Pr(|T| > |t|) = 0.0047          Pr(T > t) = 0.9976

. ttest tech_ms_pca, by(book3) // Doughnut economics

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     193    .1937553    .1009237    1.402076   -.0053061    .3928168
       1 |      84    -.445176    .1689044    1.548034     -.78112    -.109232
---------+--------------------------------------------------------------------
combined |     277    1.99e-09    .0886064    1.474704   -.1744302    .1744302
---------+--------------------------------------------------------------------
    diff |            .6389313    .1892319                .2664042    1.011458
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   3.3764
Ho: diff = 0                                     degrees of freedom =      275

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9996         Pr(|T| > |t|) = 0.0008          Pr(T > t) = 0.0004

. 
. 
. // An increase in the technological optimist mindset by one is linked to a greater likelihoo
> d of suggesting global carbon prices below 60 USD
. probit price_below temp_above tech_ms_pca $info_source $orga cops_attended $socioeconomics $
> countryspecifics , vce(robust)

Iteration 0:   log pseudolikelihood = -190.87207  
Iteration 1:   log pseudolikelihood = -155.03105  
Iteration 2:   log pseudolikelihood = -154.66925  
Iteration 3:   log pseudolikelihood =  -154.6684  
Iteration 4:   log pseudolikelihood =  -154.6684  

Probit regression                               Number of obs     =        277
                                                Wald chi2(18)     =      58.05
                                                Prob > chi2       =     0.0000
Log pseudolikelihood =  -154.6684               Pseudo R2         =     0.1897

-------------------------------------------------------------------------------------
                    |               Robust
        price_below |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
         temp_above |   .0286831   .2076425     0.14   0.890    -.3782888     .435655
        tech_ms_pca |   .1811325   .0677779     2.67   0.008     .0482903    .3139747
          info_cc_1 |   .0785976   .2104482     0.37   0.709    -.3338733    .4910685
          info_cc_2 |  -.2261426   .1887011    -1.20   0.231      -.59599    .1437048
          info_cc_3 |  -.2477511   .2653915    -0.93   0.351     -.767909    .2724067
          info_cc_4 |  -.1821977   .2418033    -0.75   0.451    -.6561235     .291728
          info_cc_5 |  -.2262368   .2832386    -0.80   0.424    -.7813741    .3289006
              orga2 |   .3128137   .2981391     1.05   0.294    -.2715282    .8971557
              orga3 |    .204554   .2962365     0.69   0.490    -.3760589    .7851669
              orga4 |    .264909   .2433012     1.09   0.276    -.2119526    .7417707
      cops_attended |   .0484617   .0149473     3.24   0.001     .0191656    .0777578
               edu1 |   -.317994   .2309408    -1.38   0.169    -.7706297    .1346417
               edu3 |   -.370095   .2841306    -1.30   0.193    -.9269808    .1867907
               edu4 |  -.7058683   .3219697    -2.19   0.028    -1.336917   -.0748193
               edu5 |  -.1999177   .3234513    -0.62   0.537    -.8338706    .4340353
lower_middle_income |   .0848646   .2394684     0.35   0.723    -.3844849    .5542141
upper_middle_income |   .4084952   .2882893     1.42   0.156    -.1565414    .9735318
        high_income |  -.9786267   .2965089    -3.30   0.001    -1.559773     -.39748
              _cons |   .7944531   .3976906     2.00   0.046     .0149938    1.573912
-------------------------------------------------------------------------------------

. margins, dydx(tech_ms_pca) post // 5.7 pp, z= 2.78, p=.005

Average marginal effects                        Number of obs     =        277
Model VCE    : Robust

Expression   : Pr(price_below), predict()
dy/dx w.r.t. : tech_ms_pca

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 tech_ms_pca |   .0574945   .0205535     2.80   0.005     .0172105    .0977786
------------------------------------------------------------------------------

. matrix B = r(b)

. gen dydx1 = B[1,1]

. sum tech_ms_pca 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 tech_ms_pca |        277    1.99e-09    1.474704  -4.940824   2.506011

. di  dydx1 * r(sd) // 8.4pp [Change of 1 SD]
.08478742

. 
. // Results at the national level demonstrate that an increase in technological optimism is s
> trongly associated with a higher probability of recommending current and future carbon price
> s below 60 USD.
. probit price_below_home_now temp_above tech_ms_pca $info_source $orga cops_attended $socioec
> onomics $countryspecifics, vce(robust)

Iteration 0:   log pseudolikelihood =  -165.5896  
Iteration 1:   log pseudolikelihood = -138.73645  
Iteration 2:   log pseudolikelihood = -138.56413  
Iteration 3:   log pseudolikelihood = -138.56401  
Iteration 4:   log pseudolikelihood = -138.56401  

Probit regression                               Number of obs     =        277
                                                Wald chi2(18)     =      54.30
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -138.56401               Pseudo R2         =     0.1632

--------------------------------------------------------------------------------------
                     |               Robust
price_below_home_now |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
          temp_above |   .2277836   .2205298     1.03   0.302    -.2044469    .6600141
         tech_ms_pca |   .1987815   .0657464     3.02   0.002     .0699209     .327642
           info_cc_1 |   .1555676    .217006     0.72   0.473    -.2697564    .5808915
           info_cc_2 |  -.1433519   .1937333    -0.74   0.459    -.5230623    .2363584
           info_cc_3 |   .2314315    .272025     0.85   0.395    -.3017277    .7645907
           info_cc_4 |  -.2965017   .2592868    -1.14   0.253    -.8046944     .211691
           info_cc_5 |  -.0850826   .3020617    -0.28   0.778    -.6771127    .5069474
               orga2 |   .2009929   .2992793     0.67   0.502    -.3855837    .7875696
               orga3 |   .1021701   .3122572     0.33   0.744    -.5098428    .7141831
               orga4 |   .3033776   .2427103     1.25   0.211    -.1723258     .779081
       cops_attended |   .0381847   .0163047     2.34   0.019     .0062281    .0701414
                edu1 |   .1011279   .2370428     0.43   0.670    -.3634675    .5657234
                edu3 |   .0829235    .280437     0.30   0.767    -.4667228    .6325698
                edu4 |  -.2535258   .3286649    -0.77   0.440    -.8976971    .3906455
                edu5 |   .4183884    .403884     1.04   0.300    -.3732098    1.209987
 lower_middle_income |   .3117858   .2516076     1.24   0.215     -.181356    .8049277
 upper_middle_income |   .5608372   .3191799     1.76   0.079     -.064744    1.186418
         high_income |  -.5073683   .2798903    -1.81   0.070    -1.055943    .0412067
               _cons |    .240775   .4098382     0.59   0.557    -.5624931    1.044043
--------------------------------------------------------------------------------------

. margins, dydx(tech_ms_pca) post // 5.8 pp, z= 3.32, p=.001

Average marginal effects                        Number of obs     =        277
Model VCE    : Robust

Expression   : Pr(price_below_home_now), predict()
dy/dx w.r.t. : tech_ms_pca

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 tech_ms_pca |   .0559909   .0174141     3.22   0.001     .0218599    .0901219
------------------------------------------------------------------------------

. matrix B = r(b)

. gen dydx2 = B[1,1]

. sum tech_ms_pca 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 tech_ms_pca |        277    1.99e-09    1.474704  -4.940824   2.506011

. di  dydx2 * r(sd) // 8.5 pp [Change of 1 SD]
.08257004

. 
. probit price_below_home_future temp_above tech_ms_pca $info_source $orga cops_attended $soci
> oeconomics $countryspecifics , vce(robust)

Iteration 0:   log pseudolikelihood = -190.87207  
Iteration 1:   log pseudolikelihood = -163.37226  
Iteration 2:   log pseudolikelihood = -163.23034  
Iteration 3:   log pseudolikelihood = -163.23027  
Iteration 4:   log pseudolikelihood = -163.23027  

Probit regression                               Number of obs     =        277
                                                Wald chi2(18)     =      55.02
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -163.23027               Pseudo R2         =     0.1448

-----------------------------------------------------------------------------------------
                        |               Robust
price_below_home_future |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
             temp_above |   .1369838   .2001328     0.68   0.494    -.2552692    .5292368
            tech_ms_pca |   .1295998   .0628135     2.06   0.039     .0064876     .252712
              info_cc_1 |   .0809152     .20563     0.39   0.694    -.3221122    .4839425
              info_cc_2 |  -.1276201    .181759    -0.70   0.483    -.4838612     .228621
              info_cc_3 |   .1562807   .2544977     0.61   0.539    -.3425255     .655087
              info_cc_4 |  -.3214688    .235656    -1.36   0.173     -.783346    .1404085
              info_cc_5 |  -.0081633   .2764073    -0.03   0.976    -.5499116    .5335851
                  orga2 |   .2794423   .2612561     1.07   0.285    -.2326103    .7914949
                  orga3 |  -.0031526   .2975374    -0.01   0.992    -.5863152    .5800099
                  orga4 |   .1448703   .2437614     0.59   0.552    -.3328933    .6226339
          cops_attended |   .0459165    .015177     3.03   0.002     .0161701    .0756628
                   edu1 |   .0520158   .2225094     0.23   0.815    -.3840946    .4881262
                   edu3 |  -.0560463   .2739446    -0.20   0.838    -.5929679    .4808753
                   edu4 |  -.3293372   .3207518    -1.03   0.305    -.9579991    .2993247
                   edu5 |   .2087522   .3362632     0.62   0.535    -.4503116     .867816
    lower_middle_income |   .0582544   .2349577     0.25   0.804    -.4022542     .518763
    upper_middle_income |   .0504003   .2740322     0.18   0.854    -.4866929    .5874934
            high_income |  -1.033188   .2863341    -3.61   0.000    -1.594392   -.4719832
                  _cons |   .1450578   .3868606     0.37   0.708     -.613175    .9032906
-----------------------------------------------------------------------------------------

. margins, dydx(tech_ms_pca) post // 4.3 pp, z= 2.08, p=.044

Average marginal effects                        Number of obs     =        277
Model VCE    : Robust

Expression   : Pr(price_below_home_future), predict()
dy/dx w.r.t. : tech_ms_pca

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 tech_ms_pca |    .043319   .0205417     2.11   0.035      .003058    .0835801
------------------------------------------------------------------------------

. matrix B = r(b)

. gen dydx3 = B[1,1]

. sum tech_ms_pca 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 tech_ms_pca |        277    1.99e-09    1.474704  -4.940824   2.506011

. di  dydx3 * r(sd) // 6.3 pp [Change of 1 SD]
.06388272

. 
. 
. 
end of do-file

. do "$working_ANALYSIS\scripts\03 - analysis_som.do"

. *--------------------------------------------------
. * Analysis Supplementary Online Material (SOM) 
. *-------------------------------------------------
. 
. 
. *********************************************************
. **********               STRUCTURE             **********
. *********************************************************
. /*
> Appendix:
>   
>   S2 Sample details
>         o Table S1. Summary statistics
>     o Table S2. Countries’ classification by income level (countries erased here for reasons
>  of anonymity)
>         o Figure S1. Origin of participants and distribution of characteristics in our sampl
> e and in the COP 24 population
> 
>         
>   S3 Measurement details: Construction and validity of the mindset measure 
>     o Figure S2. Loadings of technological optimism items in PCA
>         o Figure S3. Book recommendation and technological optimism
>         o Figure S4. Distribution of technological optimism
>         o Table S3. Using the book recommendation as alternative explanatory variables 
>   
>   
>   S4 Additional analysis and robustness checks
>   
>   S4.1 Determinants of the mindset
>     o Table S4.  Effects of technological optimism mindset on temperature rise deemed accept
> able.
>   
>   S4.2 Carbon prices suggested 
>     o Table S5. Effects of technological optimism mindset on global carbon price deemed nece
> ssary to reach stated temperature target
>     o Table S6. Effects of technological optimism mindset on global carbon prices using diff
> erent thresholds in the binary model
>         o Figure S5. Detailed view on global carbon prices named for the section 0USD to 50U
> SD
>     o Table S7. Effects of technological optimism mindset on global carbon prices excluding 
> participants naming ambitious temperature targets (≤1.5°C) and low global carbon prices at t
> he same time
>         o Table S8. Effects of technological optimism mindset on national carbon price now (
> 2021 to 2030) deemed necessary to stay below 2°C
>     o Table S9. Effects of technological optimism mindset on national carbon price in the fu
> ture (2080 to 2100) deemed necessary to stay below 2°C
>     o Table S10. Effects of technological optimism mindset on national carbon prices now (20
> 21 to 2030) using different thresholds in the binary model
>     o Table S11. Effects of technological optimism mindset on global carbon prices now using
>  different thresholds in the binary model 
>         o Table S12. Effects of technological optimism mindset on mean carbon price
>   
>   S4.3 Determinants of the mindset
>     o Table S13. Determinants of the technological optimism mindset
>   
>   S4.4 Exogenous manipulation of mindset
>     o Table S15. Balance table
>     o Table S16. Effect of increased salience carbon prices suggested as necessary
> */
. 
. 
. 
. 
. 
. 
. // Figure Settings
. * Text size: A & C
. global head     10 // Title

. global legend    8 // Legend

. global xytitle   8 // Axis title

. global xylab     8 // Scale label

. 
. * Text size: B (A&C * 2/3)
. global ratio_abc = 3/4

. display $ratio_abc * $head
7.5

. display $ratio_abc * $legend  
6

. display $ratio_abc * $xytitle
6

. display $ratio_abc * $xylab  
6

. 
. global head2    7.5  // Title

. global legend2  6    // Legend

. global xytitle2 6    // Axis title

. global xylab2   6    // Scale label

. 
. 
. 
. *--------------------------
. *        S2 Sample details  
. *---------------------------
. // Table S1. Summary statistics
. global summary temp_rise carbon_price price_home_now price_oecd_now price_ldc_now price_home
> _future price_oecd_future price_ldc_future carbon_price_mean tech_ms_pca book1 book2 book3 i
> nfo_cc_1 info_cc_2 info_cc_3 info_cc_4 info_cc_5 orga1 orga2 orga3 orga4 /*female age*/ edu1
>  edu2 edu3 edu4 edu5 cops_attended low_income lower_middle_income upper_middle_income high_i
> ncome /*co2_pc science freedom_house_index*/

. estpost sum $summary , d

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~) 
-------------+-----------------------------------------------------------------------------
   temp_rise |       277        277   1.384477   .6876929   .8292725   1.253593   7.442152 
carbon_price |       277        277    189.574   170140.2   412.4805   3.322374   13.51885 
price_home~w |       277        277   107.0289   86219.26   293.6312   4.916304   28.83314 
price_oecd~w |       277        277   162.3971     135358   367.9103   3.744708   17.35519 
price_ldc_~w |       277        277   85.23105   69370.27   263.3824   5.509913    35.9519 
price_home~e |       277        277    201.935   165428.5    406.729   3.116028   12.40012 
price_oecd~e |       277        277   262.8375     218424   467.3585   2.524015   8.531096 
price_ldc_~e |       277        277   182.3394   163355.2   404.1722   3.315847   13.63269 
carbon_pri~n |       277        277   170.1919   100869.1    317.599   3.168077   14.00338 
 tech_ms_pca |       277        277   1.99e-09   2.174753   1.474704  -.6829195   3.273536 
       book1 |       277        277   .4079422   .2424005   .4923418   .3746356   1.140352 
       book2 |       277        277   .2888087   .2061424   .4540291   .9319825   1.868591 
       book3 |       277        277   .3032491   .2120546   .4604939   .8560679   1.732852 
   info_cc_1 |       277        277   .7364621   .1947889   .4413489  -1.073482   2.152364 
   info_cc_2 |       277        277   .6534296   .2272799   .4767388  -.6448282   1.415803 
   info_cc_3 |       277        277   .8375451   .1365563   .3695352   -1.83017   4.349521 
   info_cc_4 |       277        277   .8267148   .1437765   .3791787  -1.726395    3.98044 
   info_cc_5 |       277        277   .8880866   .0997489   .3158304  -2.462011     7.0615 
       orga1 |       277        277   .6462094   .2294512   .4790106   -.611569   1.374017 
       orga2 |       277        277   .1191336    .105321   .3245319   2.351422   6.529185 
       orga3 |       277        277   .0902527   .0824046   .2870621   2.859931   9.179206 
       orga4 |       277        277   .1444043   .1239994   .3521354   2.023308   5.093776 
        edu1 |       277        277   .4548736    .248862   .4988607   .1812451    1.03285 
        edu2 |       277        277    .198556   .1597081   .3996349   1.511328   3.284111 
        edu3 |       277        277   .1696751   .1413959   .3760265   1.760104   4.097965 
        edu4 |       277        277   .0938628   .0853607   .2921656   2.785217   8.757432 
        edu5 |       277        277   .0830325    .076414   .2764307   3.022256   10.13403 
cops_atten~d |       277        277   5.815884    29.6725   5.447247   1.738914   5.785316 
  low_income |       277        277   .1805054   .1484592    .385304   1.661404   3.760264 
lower_midd~e |       277        277   .3718412   .2344216    .484171   .5303531   1.281274 
upper_midd~e |       277        277   .2021661   .1618793   .4023423    1.48318   3.199822 
 high_income |       277        277   .2454874   .1858944   .4311547   1.182746   2.398888 

             |    e(sum)     e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25) 
-------------+-----------------------------------------------------------------------------
   temp_rise |     383.5          0          5          0          0         .5          1 
carbon_price |     52512          0       2000          0          2          7         15 
price_home~w |     29647          0       2000          0          0          2         10 
price_oecd~w |     44984          0       2000          0          3          6         15 
price_ldc_~w |     23609          0       2000          0          0          0          5 
price_home~e |     55936          0       2000          0          1          5         15 
price_oecd~e |     72806          0       2000          0          2          6         25 
price_ldc_~e |     50508          0       2000          0          1          4         11 
carbon_pri~n |  47143.14          0       2000          0   3.428571   7.857143   17.85714 
 tech_ms_pca |  5.52e-07  -4.940824   2.506011   -4.12035  -2.918292  -2.017645  -.8553331 
       book1 |       113          0          1          0          0          0          0 
       book2 |        80          0          1          0          0          0          0 
       book3 |        84          0          1          0          0          0          0 
   info_cc_1 |       204          0          1          0          0          0          0 
   info_cc_2 |       181          0          1          0          0          0          0 
   info_cc_3 |       232          0          1          0          0          0          1 
   info_cc_4 |       229          0          1          0          0          0          1 
   info_cc_5 |       246          0          1          0          0          0          1 
       orga1 |       179          0          1          0          0          0          0 
       orga2 |        33          0          1          0          0          0          0 
       orga3 |        25          0          1          0          0          0          0 
       orga4 |        40          0          1          0          0          0          0 
        edu1 |       126          0          1          0          0          0          0 
        edu2 |        55          0          1          0          0          0          0 
        edu3 |        47          0          1          0          0          0          0 
        edu4 |        26          0          1          0          0          0          0 
        edu5 |        23          0          1          0          0          0          0 
cops_atten~d |      1611          0         25          0          1          1          2 
  low_income |        50          0          1          0          0          0          0 
lower_midd~e |       103          0          1          0          0          0          0 
upper_midd~e |        56          0          1          0          0          0          0 
 high_income |        68          0          1          0          0          0          0 

             |    e(p50)     e(p75)     e(p90)     e(p95)     e(p99) 
-------------+-------------------------------------------------------
   temp_rise |       1.5        1.5          2        2.5          5 
carbon_price |        50        100        500       1002       2000 
price_home~w |        25         77        175        500       2000 
price_oecd~w |        44        100        350       1000       2000 
price_ldc_~w |        18         50        100        330       2000 
price_home~e |        50        150        500       1300       2000 
price_oecd~e |        85        200       1000       1500       2000 
price_ldc_~e |        45        100        500       1200       2000 
carbon_pri~n |  59.28571   128.5714        470   942.8571   1515.571 
 tech_ms_pca |  .1587308   1.067281   1.765222   2.165586   2.506011 
       book1 |         0          1          1          1          1 
       book2 |         0          1          1          1          1 
       book3 |         0          1          1          1          1 
   info_cc_1 |         1          1          1          1          1 
   info_cc_2 |         1          1          1          1          1 
   info_cc_3 |         1          1          1          1          1 
   info_cc_4 |         1          1          1          1          1 
   info_cc_5 |         1          1          1          1          1 
       orga1 |         1          1          1          1          1 
       orga2 |         0          0          1          1          1 
       orga3 |         0          0          0          1          1 
       orga4 |         0          0          1          1          1 
        edu1 |         0          1          1          1          1 
        edu2 |         0          0          1          1          1 
        edu3 |         0          0          1          1          1 
        edu4 |         0          0          0          1          1 
        edu5 |         0          0          0          1          1 
cops_atten~d |         4          7         13         20         25 
  low_income |         0          0          1          1          1 
lower_midd~e |         0          1          1          1          1 
upper_midd~e |         0          0          1          1          1 
 high_income |         0          0          1          1          1 

. esttab . using "$working_ANALYSIS/results/tables/Table S1.rtf", cells("count(fmt(0)) mean(fm
> t(%9.2fc)) p50(fmt(%9.2fc)) sd(fmt(%9.2fc)) min(fmt(0)) max(fmt(0))")  order(Policy_suggesti
> ons temp_rise carbon_price price_home_now price_oecd_now price_ldc_now price_home_future pri
> ce_oecd_future price_ldc_future carbon_price_mean Mindset tech_ms_pca Book_Recommendation bo
> ok1 book2 book3 Information_sources_used info_cc_1 info_cc_2 info_cc_3 info_cc_4 info_cc_5 O
> rganization_working_for orga1 orga2 orga3 orga4 Socioeconomics /*female age*/ Education edu1
>  edu2 edu3 edu4 edu5 cops_attended Income-level low_income lower_middle_income upper_middle_
> income high_income /*co2_pc science freedom_house_index*/) not nostar unstack nomtitle nonum
> ber nonote  replace
(output written to C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia
> _Delegates\8_Submission\replication_delegates/results/tables/Table S1.rtf)

. 
. 
. // Table S2. Countries’ classification by income level (countries erased here for reasons of
>  anonymity)
. 
. 
. // Figure S1. Origin of participants and distribution of characteristics in our sample and i
> n the COP 24 population
. * To protect anonymity of participants, countries have been erased. Therefore, the following
>  command producing Figure S1 cannot be executed with the dataset uploaded. For reasons of tr
> ansparency, we still report the code used to produce the map.
. 
. /*
> * A. Origin of population
> /* Only needs to be run once to create _db & _co
> * Download dara for map from: https://github.com/riatelab/world
> cd "$working_ANALYSIS\data\GitHub"
> shp2dta using country.shp, database(world_db) coordinates(world_co) genid(id)
> */
> 
> *preserve
> use "$working_ANALYSIS\data\GitHub\world_db" , clear
> rename name country_home
> 
> ** Unify country names
> replace country_home = "Congo" if country_home == "Republic of Congo"
> replace country_home = "Czechia" if country_home == "Czech Republic"
> replace country_home = "Côte d’Ivoire" if country_home == "Cte d'Ivoire"
> replace country_home = "Gambia" if country_home == "The Gambia"
> replace country_home = "Lao People's Democratic Republic" if country_home == "Laos"
> replace country_home = "Micronesia" if country_home == "Federated States of Micronesia"
> replace country_home = "Republic of Korea" if country_home == "South Korea"
> replace country_home = "Viet Nam" if country_home == "Vietnam"
> 
> 
> ** Merge with dataset
> merge 1:m country_home using "$working_ANALYSIS\data\delegates_analysis_complete.dta"
> 
> gen observation = .
> replace observation = 1 if temp_rise != .
> egen obs_country = count(observation), by(country_home)
> replace obs_country = . if obs_country == 0
> 
> collapse (mean) obs_country, by(country_home id) 
> 
> spmap obs_country using world_co if country_home != "Antarctica", id(id) fcolor(Blues2) ///
> clmethod(custom) clbreaks(0 1 2 3 6.1 9.1 12) ///
> legend(symy(*1.5) symx(*1.5) size(*1.5)) legorder(lohi)  ///
> legend(label(2 "1") label(3 "2" ) label(4 "3") label(5 "4 - 6") label(6 "7 - 9") label(7 "10
>  - 12")) ///
> osize(0.1pt ..) ndfcolor(white) ndocolor(gs5) ndsize(0.2pt) legstyle(2) legtitle("Observatio
> n") title("{bf:a}", size(11pt) pos(11) span)
> graph save "$working_ANALYSIS\results\intermediate\Figure S1a", replace
> 
> // Comparision of distributions our sample vs. COP24 population
> use "$working_ANALYSIS\data\delegates_analysis_complete.dta", clear
> gen sample = 1
> append using "$working_ANALYSIS\data\cop24_parties.dta"
> replace sample = 2 if sample == .
> 
> 
> // Figure S1b: Global North vs. Global South
> tab global_south, gen(gs)
> graph bar (mean) gs1 gs2, over(sample, relabel(1 "Our Sample" 2 "COP24")) blabel(bar, format
> (%3.2g)) ytitle("Share") title("{bf:b}", size(10pt) span pos(11))  legend(order(1 "Global No
> rth" 2 "Global South") rows(2)) nodraw
> graph save "$working_ANALYSIS\results\intermediate\Figure S1b", replace
> 
> 
> // Figure S1c: Male vs. Female
> tab female, gen(fem)
> graph bar (mean) fem1 fem2, over(sample, relabel(1 "Our Sample" 2 "COP24")) blabel(bar, form
> at(%3.2g)) ytitle("Share") title("{bf:c}", size(10pt) span pos(11))  legend(order(1 "Male" 2
>  "Female") rows(2)) nodraw
> graph save "$working_ANALYSIS\results\intermediate\Figure S1c", replace
>  
> // Figure S1d: Governmental vs. Other
> replace non_gov = (orga1 - 1) * (-1) if sample == 1
> tab non_gov, gen(non_gov)
> graph bar (mean) non_gov1 non_gov2, over(sample, relabel(1 "Our Sample" 2 "COP24")) blabel(b
> ar, format(%3.2g)) ytitle("Share") title("{bf:d}", size(10pt) span pos(11))  legend(order(1 
> "Governmental" 2 "Other") rows(2)) nodraw
> graph save "$working_ANALYSIS\results\intermediate\Figure S1d", replace
> 
> * Combine B,C & D
> graph combine "$working_ANALYSIS\results\intermediate\Figure S1b" "$working_ANALYSIS\results
> \intermediate\Figure S1c" "$working_ANALYSIS\results\intermediate\Figure S1d", rows(1) iscal
> e(1.1)
> gr save  "$working_ANALYSIS\results\intermediate\Figure S1bcd", replace
> 
> 
> * Combine A with B,C&D
> graph combine "$working_ANALYSIS\results\intermediate\Figure S1a"  "$working_ANALYSIS\result
> s\intermediate\Figure S1bcd", cols(1)
> gr save  "$working_ANALYSIS\results\intermediate\Figure S1", replace
> gr export "$working_ANALYSIS\results\figures\Figure S1.tif", replace
> 
> 
> // Test for stat. diffs
> ttest global_south, by(sample)
> ttest female, by(sample)
> ttest non_gov, by(sample)
> */
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
.           
.           
. *--------------------------
. *        S3 MEASUREMENT DETAILS 
. *---------------------------
. 
. // Figure S2. Loadings of technological optimism items in PCA
. preserve

. pca tech_ms_1 tech_ms_2 tech_ms_3 tech_ms_4 tech_ms_5, blanks(0.2) comp(1)

Principal components/correlation                 Number of obs    =        277
                                                 Number of comp.  =          1
                                                 Trace            =          5
    Rotation: (unrotated = principal)            Rho              =     0.4350

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |      2.17475      1.22935             0.4350       0.4350
           Comp2 |      .945404      .168293             0.1891       0.6240
           Comp3 |      .777111       .21128             0.1554       0.7795
           Comp4 |      .565831     .0289289             0.1132       0.8926
           Comp5 |      .536902            .             0.1074       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors)  (blanks are abs(loading)<.2)

    --------------------------------------
        Variable |    Comp1 | Unexplained 
    -------------+----------+-------------
       tech_ms_1 |   0.4607 |       .5384 
       tech_ms_2 |   0.5108 |       .4326 
       tech_ms_3 |   0.4410 |       .5771 
       tech_ms_4 |   0.3815 |       .6834 
       tech_ms_5 |   0.4322 |       .5937 
    --------------------------------------

. matrix list e(L)

e(L)[5,1]
               Comp1
tech_ms_1  .46071423
tech_ms_2  .51077407
tech_ms_3  .44097472
tech_ms_4  .38152714
tech_ms_5  .43223903

. matrix define loadings = e(L)

. xsvmat double loadings, names(col) rownames(var) saving("$working_ANALYSIS/results/intermedi
> ate/tech_opt_pca", replace)
file C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_S
> ubmission\replication_delegates/results/intermediate/tech_opt_pca.dta saved

. use "$working_ANALYSIS/results/intermediate/tech_opt_pca", clear

. encode var, gen(var_nr)

. save "$working_ANALYSIS/results/intermediate/tech_opt_pca", replace
file C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_S
> ubmission\replication_delegates/results/intermediate/tech_opt_pca.dta saved

. keep var var_nr

. merge 1:1 var using "$working_ANALYSIS/results/intermediate/tech_opt_pca"
(label var_nr already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                 5  (_merge==3)
    -----------------------------------------

. 
. twoway (dropline Comp1 var_nr , horizontal mlabel(Comp1) mlabformat(%12.2f) mlabposition(top
> )) , ylabel(1(1)5, valuelabel) xlabel(0(0.2)0.6) xtitle(loadings) ytitle("") ysize(2) scale(
> *1.4)

. gr_edit yaxis1.edit_tick 1 1 `""Future generations will be richer and better equipped" "to d
> eal with adverse impacts of climate change.""', tickset(major)

. gr_edit yaxis1.edit_tick 1 2 `""Technological innovation e.g., solar geoengineering offers" 
> "a suitable solution to respond in case of a future climate emergency.""', tickset(major)

. gr_edit yaxis1.edit_tick 1 3 `""The present costs and future benefits to society must be wei
> ghed" "against each other, while deciding about emission reduction policies.""', tickset(maj
> or)

. gr_edit yaxis1.edit_tick 1 4 `""Technological innovations for climate change emerge more lik
> ely" "in a free-market economy without much interference from the Government.""', tickset(ma
> jor)

. gr_edit yaxis1.edit_tick 1 5 `""The transformation towards a sustainable society is possible
>  by making productions" "more resourcesaving and without harming the economy (e.g. constant 
> growth).""', tickset(major)

. graph export "$working_ANALYSIS/results/figures/Figure S2.tif", replace  width(4000)
(file C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_
> Submission\replication_delegates/results/figures/Figure S2.tif written in TIFF format)

. restore

. 
. 
. // Figure S3. Book recommendation and technological optimism
. gen book_2 = .
(277 missing values generated)

. replace book_2 = 1 if book == 2
(80 real changes made)

. replace book_2 = 2 if book == 1
(113 real changes made)

. replace book_2 = 3 if book == 3
(84 real changes made)

. 
. stripplot tech_ms_pca, over(book_2) separate(book_2) mcolor(gs8*.35 gs8*.35 gs8*.35) msymbol
> (o o o) yla(-5(1)3 , nogrid) xtitle("") ytitle("Technological optimism") vertical center cum
> ul cumprob bar boffset(.4) refline(lw(medium) lc(gs10) lp(solid)) reflinestretch(0.1) xla(, 
> noticks) yla(, ang(h)) title("") xlab(1 "More from less (n=82)" 2 `""Good Economics for" "ha
> rd times (n=114)""' 3 "Dougnut Economics (n=84)") legend(order(4 "Observation" 3 "Mean" 2 "9
> 5% Confidence Interval" )) yline(0, lpattern(dash) lcolor(gs3*.4)) ysize(3) scale(*1.2)

. graph export "$working_ANALYSIS/results/figures/Figure S3.tif", replace width(3650)
(file C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_
> Submission\replication_delegates/results/figures/Figure S3.tif written in TIFF format)

. 
. ttest tech_ms_pca if book != 1, by(book) // (2) More from less vs. (3) Doughnut Economics 

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
More fro |      80    .3908448    .1491937    1.334429     .093882    .6878075
Doughnut |      84    -.445176    .1689044    1.548034     -.78112    -.109232
---------+--------------------------------------------------------------------
combined |     164    -.037361    .1173643    1.502996   -.2691114    .1943894
---------+--------------------------------------------------------------------
    diff |            .8360207    .2261774                .3893847    1.282657
------------------------------------------------------------------------------
    diff = mean(More fro) - mean(Doughnut)                        t =   3.6963
Ho: diff = 0                                     degrees of freedom =      162

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9999         Pr(|T| > |t|) = 0.0003          Pr(T > t) = 0.0001

. ttest tech_ms_pca if book != 3, by(book) // (1) Good economics for hard times vs. (2) More f
> rom less 

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Good Eco |     113     .054223    .1352335    1.437551   -.2137247    .3221708
More fro |      80    .3908448    .1491937    1.334429     .093882    .6878075
---------+--------------------------------------------------------------------
combined |     193    .1937553    .1009237    1.402076   -.0053061    .3928168
---------+--------------------------------------------------------------------
    diff |           -.3366217    .2039505               -.7389064    .0656629
------------------------------------------------------------------------------
    diff = mean(Good Eco) - mean(More fro)                        t =  -1.6505
Ho: diff = 0                                     degrees of freedom =      191

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0502         Pr(|T| > |t|) = 0.1005          Pr(T > t) = 0.9498

. ttest tech_ms_pca if book != 2, by(book) // (1) Good economics for hard times vs. (3) Doughn
> ut Economics

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Good Eco |     113     .054223    .1352335    1.437551   -.2137247    .3221708
Doughnut |      84    -.445176    .1689044    1.548034     -.78112    -.109232
---------+--------------------------------------------------------------------
combined |     197   -.1587187    .1070368    1.502333   -.3698103     .052373
---------+--------------------------------------------------------------------
    diff |             .499399    .2140183                .0773113    .9214867
------------------------------------------------------------------------------
    diff = mean(Good Eco) - mean(Doughnut)                        t =   2.3334
Ho: diff = 0                                     degrees of freedom =      195

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9897         Pr(|T| > |t|) = 0.0206          Pr(T > t) = 0.0103

. 
. 
. // Figure S4. Distribution of technological optimism
. hist tech_ms_pca, start(-5.5) percent scale(*2) ysize(2) xtitle("Technological optimism")
(bin=16, start=-5.5, width=.50037569)

. graph export "$working_ANALYSIS/results/figures/Figure S4.tif", replace width(3650)
(file C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_
> Submission\replication_delegates/results/figures/Figure S4.tif written in TIFF format)

. 
. 
. // Table S3.    Using the book recommendation as alternative explanatory variables 
. * Set globals
. global info_source info_cc_1 info_cc_2 info_cc_3 info_cc_4 info_cc_5

. global socioeconomics /*female age*/ edu1 edu3 edu4 edu5 // Education ref. cat.: edu2 (Socia
> l Sciences)

. global orga orga2 orga3 orga4 // Governmental organization ref. cat.

. global countryspecifics lower_middle_income upper_middle_income high_income /*co2_pc ln_scie
> nce freedom_house_index*/

. 
. ** DV: Global carbon price suggested below USD60
. probit price_below temp_rise book1 book3 $info_source $orga cops_attended $socioeconomics $c
> ountryspecifics treat_tech, vce(robust) 

Iteration 0:   log pseudolikelihood = -190.87207  
Iteration 1:   log pseudolikelihood = -150.17648  
Iteration 2:   log pseudolikelihood = -149.74086  
Iteration 3:   log pseudolikelihood =  -149.7405  
Iteration 4:   log pseudolikelihood =  -149.7405  

Probit regression                               Number of obs     =        277
                                                Wald chi2(20)     =      71.41
                                                Prob > chi2       =     0.0000
Log pseudolikelihood =  -149.7405               Pseudo R2         =     0.2155

-------------------------------------------------------------------------------------
                    |               Robust
        price_below |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          temp_rise |   .0137359   .0981306     0.14   0.889    -.1785965    .2060684
              book1 |  -.3170739   .2096847    -1.51   0.130    -.7280484    .0939005
              book3 |   -.788717   .2224788    -3.55   0.000    -1.224768   -.3526665
          info_cc_1 |   .0188404   .2160581     0.09   0.931    -.4046257    .4423066
          info_cc_2 |  -.1089709   .1846671    -0.59   0.555    -.4709118      .25297
          info_cc_3 |  -.2223361   .2725053    -0.82   0.415    -.7564367    .3117645
          info_cc_4 |  -.1235024   .2407333    -0.51   0.608     -.595331    .3483262
          info_cc_5 |  -.1085314   .2712954    -0.40   0.689    -.6402606    .4231978
              orga2 |   .3229223   .2951408     1.09   0.274     -.255543    .9013876
              orga3 |   .1392191   .3056788     0.46   0.649    -.4599003    .7383386
              orga4 |    .237059   .2378404     1.00   0.319    -.2290996    .7032176
      cops_attended |   .0449018   .0154861     2.90   0.004     .0145496     .075254
               edu1 |  -.2501762   .2210978    -1.13   0.258    -.6835199    .1831675
               edu3 |  -.3147523   .2730542    -1.15   0.249    -.8499287     .220424
               edu4 |  -.7618351   .3295929    -2.31   0.021    -1.407825   -.1158448
               edu5 |  -.1786799   .3327691    -0.54   0.591    -.8308954    .4735355
lower_middle_income |   .0140743   .2353501     0.06   0.952    -.4472036    .4753521
upper_middle_income |   .2597457   .2827619     0.92   0.358    -.2944574    .8139488
        high_income |  -1.169104   .2926792    -3.99   0.000    -1.742745   -.5954638
         treat_tech |   -.391177   .1745918    -2.24   0.025    -.7333706   -.0489833
              _cons |   1.254145   .4421466     2.84   0.005      .387554    2.120737
-------------------------------------------------------------------------------------

. margins, dydx(*)

Average marginal effects                        Number of obs     =        277
Model VCE    : Robust

Expression   : Pr(price_below), predict()
dy/dx w.r.t. : temp_rise book1 book3 info_cc_1 info_cc_2 info_cc_3 info_cc_4 info_cc_5 orga2
               orga3 orga4 cops_attended edu1 edu3 edu4 edu5 lower_middle_income
               upper_middle_income high_income treat_tech

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          temp_rise |   .0041911   .0299549     0.14   0.889    -.0545194    .0629016
              book1 |  -.0967456   .0634805    -1.52   0.128    -.2211651    .0276739
              book3 |  -.2406533   .0641926    -3.75   0.000    -.3664685   -.1148382
          info_cc_1 |   .0057486   .0659253     0.09   0.931    -.1234627    .1349599
          info_cc_2 |  -.0332492   .0561495    -0.59   0.554    -.1433002    .0768018
          info_cc_3 |  -.0678392   .0828012    -0.82   0.413    -.2301266    .0944482
          info_cc_4 |   -.037683   .0733002    -0.51   0.607    -.1813488    .1059827
          info_cc_5 |  -.0331151   .0828208    -0.40   0.689    -.1954409    .1292107
              orga2 |     .09853   .0892101     1.10   0.269    -.0763186    .2733787
              orga3 |   .0424785   .0930764     0.46   0.648    -.1399479     .224905
              orga4 |   .0723314   .0720675     1.00   0.316    -.0689182     .213581
      cops_attended |   .0137004   .0045669     3.00   0.003     .0047495    .0226514
               edu1 |  -.0763338   .0669043    -1.14   0.254    -.2074638    .0547963
               edu3 |  -.0960372   .0827305    -1.16   0.246     -.258186    .0661116
               edu4 |  -.2324511   .0989306    -2.35   0.019    -.4263514   -.0385508
               edu5 |  -.0545188   .1016048    -0.54   0.592    -.2536606     .144623
lower_middle_income |   .0042943   .0717939     0.06   0.952    -.1364192    .1450078
upper_middle_income |   .0792536   .0858304     0.92   0.356    -.0889708     .247478
        high_income |  -.3567171   .0826469    -4.32   0.000    -.5187021   -.1947322
         treat_tech |  -.1193559   .0519497    -2.30   0.022    -.2211754   -.0175364
-------------------------------------------------------------------------------------

. local r2_p = e(r2_p)

. eststo table_3_1: margins, dydx(*) post

Average marginal effects                        Number of obs     =        277
Model VCE    : Robust

Expression   : Pr(price_below), predict()
dy/dx w.r.t. : temp_rise book1 book3 info_cc_1 info_cc_2 info_cc_3 info_cc_4 info_cc_5 orga2
               orga3 orga4 cops_attended edu1 edu3 edu4 edu5 lower_middle_income
               upper_middle_income high_income treat_tech

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          temp_rise |   .0041911   .0299549     0.14   0.889    -.0545194    .0629016
              book1 |  -.0967456   .0634805    -1.52   0.128    -.2211651    .0276739
              book3 |  -.2406533   .0641926    -3.75   0.000    -.3664685   -.1148382
          info_cc_1 |   .0057486   .0659253     0.09   0.931    -.1234627    .1349599
          info_cc_2 |  -.0332492   .0561495    -0.59   0.554    -.1433002    .0768018
          info_cc_3 |  -.0678392   .0828012    -0.82   0.413    -.2301266    .0944482
          info_cc_4 |   -.037683   .0733002    -0.51   0.607    -.1813488    .1059827
          info_cc_5 |  -.0331151   .0828208    -0.40   0.689    -.1954409    .1292107
              orga2 |     .09853   .0892101     1.10   0.269    -.0763186    .2733787
              orga3 |   .0424785   .0930764     0.46   0.648    -.1399479     .224905
              orga4 |   .0723314   .0720675     1.00   0.316    -.0689182     .213581
      cops_attended |   .0137004   .0045669     3.00   0.003     .0047495    .0226514
               edu1 |  -.0763338   .0669043    -1.14   0.254    -.2074638    .0547963
               edu3 |  -.0960372   .0827305    -1.16   0.246     -.258186    .0661116
               edu4 |  -.2324511   .0989306    -2.35   0.019    -.4263514   -.0385508
               edu5 |  -.0545188   .1016048    -0.54   0.592    -.2536606     .144623
lower_middle_income |   .0042943   .0717939     0.06   0.952    -.1364192    .1450078
upper_middle_income |   .0792536   .0858304     0.92   0.356    -.0889708     .247478
        high_income |  -.3567171   .0826469    -4.32   0.000    -.5187021   -.1947322
         treat_tech |  -.1193559   .0519497    -2.30   0.022    -.2211754   -.0175364
-------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .21549286

. 
. ** DV: Log global carbon price
. eststo table_3_2: reg ln_carbon_price temp_rise book1 book3 $info_source $orga cops_attended
>  $socioeconomics $countryspecifics treat_tech, vce(robust) 

Linear regression                               Number of obs     =        277
                                                F(20, 256)        =       4.39
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1617
                                                Root MSE          =     1.5638

-------------------------------------------------------------------------------------
                    |               Robust
    ln_carbon_price |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          temp_rise |  -.0394498   .1233847    -0.32   0.749    -.2824281    .2035285
              book1 |   .1798105   .2407296     0.75   0.456    -.2942519     .653873
              book3 |   .6803672   .2402484     2.83   0.005     .2072524    1.153482
          info_cc_1 |  -.0747289   .2681761    -0.28   0.781    -.6028411    .4533833
          info_cc_2 |  -.0932801   .2143623    -0.44   0.664    -.5154182     .328858
          info_cc_3 |   .4014329   .3570766     1.12   0.262    -.3017488    1.104615
          info_cc_4 |   .0359932   .2814203     0.13   0.898    -.5182006    .5901869
          info_cc_5 |  -.0065276   .3150826    -0.02   0.983    -.6270115    .6139563
              orga2 |  -.0681102   .2975901    -0.23   0.819    -.6541467    .5179262
              orga3 |   .0891211   .3904801     0.23   0.820    -.6798411    .8580833
              orga4 |  -.0296149   .2569641    -0.12   0.908    -.5356476    .4764179
      cops_attended |  -.0421083   .0159966    -2.63   0.009      -.07361   -.0106066
               edu1 |   .0377001   .2717626     0.14   0.890    -.4974749    .5728752
               edu3 |    .476377   .3474067     1.37   0.172    -.2077619    1.160516
               edu4 |   .2912884   .3713323     0.78   0.434    -.4399667    1.022543
               edu5 |   .1631492   .3694856     0.44   0.659    -.5644692    .8907676
lower_middle_income |  -.2096013   .3362945    -0.62   0.534    -.8718573    .4526547
upper_middle_income |  -.0023244    .338682    -0.01   0.995    -.6692821    .6646332
        high_income |   .8718434   .3402932     2.56   0.011     .2017129    1.541974
         treat_tech |   .2537734    .204142     1.24   0.215    -.1482382     .655785
              _cons |   3.276726   .5363231     6.11   0.000     2.220559    4.332893
-------------------------------------------------------------------------------------

. 
. ** DV: National carbon price now suggested below USD60
. probit price_below_home_now book1 book3 $info_source $orga cops_attended $socioeconomics $co
> untryspecifics treat_tech, vce(robust)

Iteration 0:   log pseudolikelihood =  -165.5896  
Iteration 1:   log pseudolikelihood = -140.96799  
Iteration 2:   log pseudolikelihood = -140.76017  
Iteration 3:   log pseudolikelihood = -140.76005  
Iteration 4:   log pseudolikelihood = -140.76005  

Probit regression                               Number of obs     =        277
                                                Wald chi2(19)     =      53.84
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -140.76005               Pseudo R2         =     0.1499

--------------------------------------------------------------------------------------
                     |               Robust
price_below_home_now |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
               book1 |  -.3317306   .2203929    -1.51   0.132    -.7636928    .1002315
               book3 |  -.5517835   .2354799    -2.34   0.019    -1.013316   -.0902515
           info_cc_1 |   .0920341   .2203836     0.42   0.676    -.3399097     .523978
           info_cc_2 |  -.0739114   .1874038    -0.39   0.693     -.441216    .2933932
           info_cc_3 |   .2145917   .2811395     0.76   0.445    -.3364316    .7656151
           info_cc_4 |  -.2655224   .2610832    -1.02   0.309    -.7772361    .2461914
           info_cc_5 |   .0066323   .3021305     0.02   0.982    -.5855326    .5987972
               orga2 |   .2354236   .3053651     0.77   0.441    -.3630811    .8339282
               orga3 |   .0889822   .3067076     0.29   0.772    -.5121537    .6901181
               orga4 |   .2205686   .2469169     0.89   0.372    -.2633795    .7045167
       cops_attended |   .0378971   .0164064     2.31   0.021     .0057413     .070053
                edu1 |   .2267252   .2291424     0.99   0.322    -.2223857    .6758361
                edu3 |   .1504824   .2759353     0.55   0.586    -.3903408    .6913057
                edu4 |   -.282042   .3149318    -0.90   0.370    -.8992969    .3352129
                edu5 |   .4743354   .4065335     1.17   0.243    -.3224556    1.271126
 lower_middle_income |   .2904917   .2472035     1.18   0.240    -.1940182    .7750016
 upper_middle_income |   .4595092   .3013707     1.52   0.127    -.1311665    1.050185
         high_income |  -.7135389   .2648425    -2.69   0.007    -1.232621   -.1944571
          treat_tech |  -.1632072   .1761254    -0.93   0.354    -.5084066    .1819922
               _cons |   .6080082   .4084472     1.49   0.137    -.1925335     1.40855
--------------------------------------------------------------------------------------

. margins, dydx(*)

Average marginal effects                        Number of obs     =        277
Model VCE    : Robust

Expression   : Pr(price_below_home_now), predict()
dy/dx w.r.t. : book1 book3 info_cc_1 info_cc_2 info_cc_3 info_cc_4 info_cc_5 orga2 orga3
               orga4 cops_attended edu1 edu3 edu4 edu5 lower_middle_income
               upper_middle_income high_income treat_tech

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
              book1 |  -.0947271   .0620589    -1.53   0.127    -.2163603    .0269061
              book3 |  -.1575642   .0651303    -2.42   0.016    -.2852173   -.0299111
          info_cc_1 |   .0262807   .0631093     0.42   0.677    -.0974112    .1499727
          info_cc_2 |  -.0211057   .0534684    -0.39   0.693    -.1259018    .0836904
          info_cc_3 |   .0612776     .08012     0.76   0.444    -.0957547      .21831
          info_cc_4 |  -.0758211   .0740022    -1.02   0.306    -.2208628    .0692207
          info_cc_5 |   .0018939   .0862677     0.02   0.982    -.1671877    .1709755
              orga2 |   .0672262   .0865891     0.78   0.438    -.1024852    .2369377
              orga3 |   .0254093   .0875558     0.29   0.772     -.146197    .1970155
              orga4 |   .0629843   .0704708     0.89   0.371    -.0751359    .2011046
      cops_attended |   .0108217   .0047312     2.29   0.022     .0015488    .0200946
               edu1 |   .0647424   .0649271     1.00   0.319    -.0625124    .1919971
               edu3 |   .0429709    .078692     0.55   0.585    -.1112626    .1972044
               edu4 |  -.0805383   .0900028    -0.89   0.371    -.2569407     .095864
               edu5 |   .1354486   .1147466     1.18   0.238    -.0894507    .3603478
lower_middle_income |   .0829512   .0697096     1.19   0.234    -.0536772    .2195796
upper_middle_income |   .1312149   .0849833     1.54   0.123    -.0353494    .2977791
        high_income |  -.2037541   .0742912    -2.74   0.006    -.3493621   -.0581461
         treat_tech |  -.0466045   .0502589    -0.93   0.354    -.1451101    .0519011
-------------------------------------------------------------------------------------

. local r2_p = e(r2_p)

. eststo table_3_3: margins, dydx(*) post

Average marginal effects                        Number of obs     =        277
Model VCE    : Robust

Expression   : Pr(price_below_home_now), predict()
dy/dx w.r.t. : book1 book3 info_cc_1 info_cc_2 info_cc_3 info_cc_4 info_cc_5 orga2 orga3
               orga4 cops_attended edu1 edu3 edu4 edu5 lower_middle_income
               upper_middle_income high_income treat_tech

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
              book1 |  -.0947271   .0620589    -1.53   0.127    -.2163603    .0269061
              book3 |  -.1575642   .0651303    -2.42   0.016    -.2852173   -.0299111
          info_cc_1 |   .0262807   .0631093     0.42   0.677    -.0974112    .1499727
          info_cc_2 |  -.0211057   .0534684    -0.39   0.693    -.1259018    .0836904
          info_cc_3 |   .0612776     .08012     0.76   0.444    -.0957547      .21831
          info_cc_4 |  -.0758211   .0740022    -1.02   0.306    -.2208628    .0692207
          info_cc_5 |   .0018939   .0862677     0.02   0.982    -.1671877    .1709755
              orga2 |   .0672262   .0865891     0.78   0.438    -.1024852    .2369377
              orga3 |   .0254093   .0875558     0.29   0.772     -.146197    .1970155
              orga4 |   .0629843   .0704708     0.89   0.371    -.0751359    .2011046
      cops_attended |   .0108217   .0047312     2.29   0.022     .0015488    .0200946
               edu1 |   .0647424   .0649271     1.00   0.319    -.0625124    .1919971
               edu3 |   .0429709    .078692     0.55   0.585    -.1112626    .1972044
               edu4 |  -.0805383   .0900028    -0.89   0.371    -.2569407     .095864
               edu5 |   .1354486   .1147466     1.18   0.238    -.0894507    .3603478
lower_middle_income |   .0829512   .0697096     1.19   0.234    -.0536772    .2195796
upper_middle_income |   .1312149   .0849833     1.54   0.123    -.0353494    .2977791
        high_income |  -.2037541   .0742912    -2.74   0.006    -.3493621   -.0581461
         treat_tech |  -.0466045   .0502589    -0.93   0.354    -.1451101    .0519011
-------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .14994627

. 
. ** DV: Log global carbon price
. eststo table_3_4: reg ln_price_home_now book1 book3 $info_source $orga cops_attended $socioe
> conomics $countryspecifics treat_tech, vce(robust)

Linear regression                               Number of obs     =        277
                                                F(19, 257)        =       4.34
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1657
                                                Root MSE          =      1.566

-------------------------------------------------------------------------------------
                    |               Robust
  ln_price_home_now |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
              book1 |   .0487134   .2356581     0.21   0.836    -.4153534    .5127801
              book3 |   .5098793   .2425531     2.10   0.037     .0322347     .987524
          info_cc_1 |   .0697989   .2762233     0.25   0.801    -.4741503    .6137481
          info_cc_2 |    .119582   .2056876     0.58   0.561    -.2854657    .5246297
          info_cc_3 |    -.12022   .3329499    -0.36   0.718    -.7758774    .5354374
          info_cc_4 |   .2593325   .2756983     0.94   0.348     -.283583     .802248
          info_cc_5 |  -.4399114   .3078843    -1.43   0.154    -1.046209    .1663858
              orga2 |  -.1270108   .3237811    -0.39   0.695    -.7646126    .5105911
              orga3 |   .1006939   .3392422     0.30   0.767    -.5673545    .7687422
              orga4 |  -.3069327   .2553992    -1.20   0.231    -.8098744     .196009
      cops_attended |  -.0470356   .0159341    -2.95   0.003    -.0784137   -.0156575
               edu1 |  -.2493643   .2868753    -0.87   0.386    -.8142899    .3155613
               edu3 |   .0882108   .3482077     0.25   0.800    -.5974928    .7739145
               edu4 |   .4444556   .3470091     1.28   0.201    -.2388878    1.127799
               edu5 |  -.2609066   .4883783    -0.53   0.594     -1.22264    .7008263
lower_middle_income |   -.264031   .3118953    -0.85   0.398    -.8782269     .350165
upper_middle_income |   -.158387   .3337927    -0.47   0.636    -.8157041    .4989302
        high_income |   .8636717   .3303609     2.61   0.009     .2131127    1.514231
         treat_tech |    .187136   .1962801     0.95   0.341    -.1993861    .5736581
              _cons |   3.443195   .5011627     6.87   0.000     2.456287    4.430103
-------------------------------------------------------------------------------------

. 
. ** DV: National carbon price now suggested below USD60
. probit price_below_home_future book1 book3 $info_source $orga cops_attended $socioeconomics 
> $countryspecifics treat_tech, vce(robust)

Iteration 0:   log pseudolikelihood = -190.87207  
Iteration 1:   log pseudolikelihood = -162.87656  
Iteration 2:   log pseudolikelihood =  -162.7697  
Iteration 3:   log pseudolikelihood = -162.76966  
Iteration 4:   log pseudolikelihood = -162.76966  

Probit regression                               Number of obs     =        277
                                                Wald chi2(19)     =      55.91
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -162.76966               Pseudo R2         =     0.1472

-----------------------------------------------------------------------------------------
                        |               Robust
price_below_home_future |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
                  book1 |   -.245111   .2031891    -1.21   0.228    -.6433544    .1531324
                  book3 |   -.523744   .2128225    -2.46   0.014    -.9408683   -.1066196
              info_cc_1 |   .0315558   .2092393     0.15   0.880    -.3785458    .4416574
              info_cc_2 |  -.0597649   .1772875    -0.34   0.736    -.4072421    .2877123
              info_cc_3 |   .1542748   .2572356     0.60   0.549    -.3498978    .6584473
              info_cc_4 |  -.3016857   .2366299    -1.27   0.202    -.7654717    .1621003
              info_cc_5 |   .0788732   .2748706     0.29   0.774    -.4598632    .6176097
                  orga2 |    .318394   .2653005     1.20   0.230    -.2015854    .8383734
                  orga3 |  -.0028145   .2984266    -0.01   0.992    -.5877199    .5820908
                  orga4 |   .1194624    .242796     0.49   0.623     -.356409    .5953339
          cops_attended |   .0452349   .0153045     2.96   0.003     .0152386    .0752312
                   edu1 |   .1495634   .2177146     0.69   0.492    -.2771494    .5762762
                   edu3 |   .0049576   .2714235     0.02   0.985    -.5270227    .5369378
                   edu4 |  -.3120116   .3207375    -0.97   0.331    -.9406455    .3166224
                   edu5 |   .2533446   .3367187     0.75   0.452     -.406612    .9133012
    lower_middle_income |   .0382462   .2361824     0.16   0.871    -.4246628    .5011551
    upper_middle_income |  -.0104078   .2706647    -0.04   0.969    -.5409009    .5200852
            high_income |  -1.144041   .2809336    -4.07   0.000    -1.694661   -.5934214
             treat_tech |  -.0918002   .1670823    -0.55   0.583    -.4192755    .2356751
                  _cons |   .3776079   .4030749     0.94   0.349    -.4124044     1.16762
-----------------------------------------------------------------------------------------

. margins, dydx(*)

Average marginal effects                        Number of obs     =        277
Model VCE    : Robust

Expression   : Pr(price_below_home_future), predict()
dy/dx w.r.t. : book1 book3 info_cc_1 info_cc_2 info_cc_3 info_cc_4 info_cc_5 orga2 orga3
               orga4 cops_attended edu1 edu3 edu4 edu5 lower_middle_income
               upper_middle_income high_income treat_tech

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
              book1 |  -.0816558   .0670936    -1.22   0.224    -.2131568    .0498453
              book3 |   -.174479   .0688955    -2.53   0.011    -.3095116   -.0394463
          info_cc_1 |   .0105124   .0697097     0.15   0.880     -.126116    .1471409
          info_cc_2 |    -.01991   .0589961    -0.34   0.736    -.1355401    .0957202
          info_cc_3 |   .0513948   .0855938     0.60   0.548    -.1163659    .2191555
          info_cc_4 |  -.1005029    .078012    -1.29   0.198    -.2534037    .0523978
          info_cc_5 |   .0262757   .0915052     0.29   0.774    -.1530711    .2056225
              orga2 |   .1060691   .0878025     1.21   0.227    -.0660207    .2781589
              orga3 |  -.0009376   .0994173    -0.01   0.992     -.195792    .1939167
              orga4 |   .0397975   .0808712     0.49   0.623    -.1187072    .1983022
      cops_attended |   .0150695   .0049499     3.04   0.002     .0053679     .024771
               edu1 |   .0498252   .0724077     0.69   0.491    -.0920913    .1917418
               edu3 |   .0016516   .0904223     0.02   0.985    -.1755729     .178876
               edu4 |  -.1039429   .1066619    -0.97   0.330    -.3129964    .1051107
               edu5 |   .0843987   .1119842     0.75   0.451    -.1350863    .3038836
lower_middle_income |   .0127412   .0786579     0.16   0.871    -.1414253    .1669078
upper_middle_income |  -.0034672   .0901674    -0.04   0.969    -.1801922    .1732577
        high_income |  -.3811235   .0859737    -4.43   0.000    -.5496288   -.2126182
         treat_tech |  -.0305821   .0555558    -0.55   0.582    -.1394694    .0783051
-------------------------------------------------------------------------------------

. local r2_p = e(r2_p)

. eststo table_3_5: margins, dydx(*) post

Average marginal effects                        Number of obs     =        277
Model VCE    : Robust

Expression   : Pr(price_below_home_future), predict()
dy/dx w.r.t. : book1 book3 info_cc_1 info_cc_2 info_cc_3 info_cc_4 info_cc_5 orga2 orga3
               orga4 cops_attended edu1 edu3 edu4 edu5 lower_middle_income
               upper_middle_income high_income treat_tech

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
              book1 |  -.0816558   .0670936    -1.22   0.224    -.2131568    .0498453
              book3 |   -.174479   .0688955    -2.53   0.011    -.3095116   -.0394463
          info_cc_1 |   .0105124   .0697097     0.15   0.880     -.126116    .1471409
          info_cc_2 |    -.01991   .0589961    -0.34   0.736    -.1355401    .0957202
          info_cc_3 |   .0513948   .0855938     0.60   0.548    -.1163659    .2191555
          info_cc_4 |  -.1005029    .078012    -1.29   0.198    -.2534037    .0523978
          info_cc_5 |   .0262757   .0915052     0.29   0.774    -.1530711    .2056225
              orga2 |   .1060691   .0878025     1.21   0.227    -.0660207    .2781589
              orga3 |  -.0009376   .0994173    -0.01   0.992     -.195792    .1939167
              orga4 |   .0397975   .0808712     0.49   0.623    -.1187072    .1983022
      cops_attended |   .0150695   .0049499     3.04   0.002     .0053679     .024771
               edu1 |   .0498252   .0724077     0.69   0.491    -.0920913    .1917418
               edu3 |   .0016516   .0904223     0.02   0.985    -.1755729     .178876
               edu4 |  -.1039429   .1066619    -0.97   0.330    -.3129964    .1051107
               edu5 |   .0843987   .1119842     0.75   0.451    -.1350863    .3038836
lower_middle_income |   .0127412   .0786579     0.16   0.871    -.1414253    .1669078
upper_middle_income |  -.0034672   .0901674    -0.04   0.969    -.1801922    .1732577
        high_income |  -.3811235   .0859737    -4.43   0.000    -.5496288   -.2126182
         treat_tech |  -.0305821   .0555558    -0.55   0.582    -.1394694    .0783051
-------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .14723166

. 
. ** DV: Log global carbon price
. eststo table_3_6: reg ln_price_home_future book1 book3 $info_source $orga cops_attended $soc
> ioeconomics $countryspecifics treat_tech, vce(robust)

Linear regression                               Number of obs     =        277
                                                F(19, 257)        =       3.34
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1521
                                                Root MSE          =     1.6797

-------------------------------------------------------------------------------------
                    |               Robust
ln_price_home_fut~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
              book1 |   .1541269   .2591324     0.59   0.553    -.3561664    .6644202
              book3 |   .7194357   .2692094     2.67   0.008     .1892985    1.249573
          info_cc_1 |   .1864639   .2812278     0.66   0.508    -.3673404    .7402681
          info_cc_2 |  -.0111517   .2204295    -0.05   0.960    -.4452297    .4229264
          info_cc_3 |   -.179621   .3871392    -0.46   0.643      -.94199     .582748
          info_cc_4 |   .4053802   .2877806     1.41   0.160    -.1613281    .9720885
          info_cc_5 |  -.4195804   .3360209    -1.25   0.213    -1.081285    .2421246
              orga2 |  -.4470851   .3583601    -1.25   0.213    -1.152781     .258611
              orga3 |  -.1751371   .3500115    -0.50   0.617    -.8643928    .5141187
              orga4 |  -.2151002   .3022228    -0.71   0.477    -.8102488    .3800483
      cops_attended |  -.0390703   .0193757    -2.02   0.045    -.0772256    -.000915
               edu1 |  -.1713371   .2849978    -0.60   0.548    -.7325655    .3898913
               edu3 |   .2169951   .3613336     0.60   0.549    -.4945565    .9285468
               edu4 |   .4200409   .3696389     1.14   0.257    -.3078658    1.147948
               edu5 |  -.1668163   .4451771    -0.37   0.708    -1.043476    .7098431
lower_middle_income |  -.2685555   .3303964    -0.81   0.417    -.9191845    .3820736
upper_middle_income |   .1619885    .352481     0.46   0.646    -.5321303    .8561073
        high_income |    .908892   .3699562     2.46   0.015     .1803604    1.637424
         treat_tech |   .0716014   .2078055     0.34   0.731     -.337617    .4808199
              _cons |   3.865251    .522153     7.40   0.000     2.837008    4.893494
-------------------------------------------------------------------------------------

. 
. esttab table_3_1 table_3_2 table_3_3 table_3_4 table_3_5 table_3_6 using "$working_ANALYSIS/
> results/tables/Table S3.rtf", p mtitles("Price<60USD" "(ln) Price" "Price<60USD" "(ln) Price
> " "Price<60USD" "(ln) Price") b(%4.2f) order(temp_rise book1 book3 Info_source $info_source 
> Orga_working $orga SocioEcon cops_attended $socioeconomics Income-level income) label stats(
> r2_p r2_a df_r N, labels("Pseudo R2" "Adjusted R2" "Degrees of freedom" "Observation") fmt(%
> 4.2f %4.2f %4.0f %4.0f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break
> }{hline @width}")) nonotes replace
(output written to C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia
> _Delegates\8_Submission\replication_delegates/results/tables/Table S3.rtf)

. 
. 
. 
. 
. 
. 
. 
. 
. 
.           
. ************************************************************
. *        S4 Additional Analysis and Robustness Tests       *
. ************************************************************
. * Set globals
. global info_source info_cc_1 info_cc_2 info_cc_3 info_cc_4 info_cc_5

. global socioeconomics /*female age*/ edu1 edu3 edu4 edu5 // Education ref. cat.: edu2 (Socia
> l Sciences)

. global orga orga2 orga3 orga4 // Governmental organization ref. cat.

. global countryspecifics lower_middle_income upper_middle_income high_income /*co2_pc ln_scie
> nce freedom_house_index*/

. 
. // S4.1 Temperature rise deemed acceptable
. * Table S4. Effects of technological optimism mindset on temperature rise deemed acceptable.
. * Col 1: Binary model [Temp-rise >= 2°C]
. probit temp_above tech_ms_pca  $info_source $orga cops_attended $socioeconomics $countryspec
> ifics treat_tech, vce(robust)

Iteration 0:   log pseudolikelihood = -146.02941  
Iteration 1:   log pseudolikelihood = -133.25327  
Iteration 2:   log pseudolikelihood = -133.10226  
Iteration 3:   log pseudolikelihood = -133.10224  
Iteration 4:   log pseudolikelihood = -133.10224  

Probit regression                               Number of obs     =        277
                                                Wald chi2(18)     =      25.85
                                                Prob > chi2       =     0.1033
Log pseudolikelihood = -133.10224               Pseudo R2         =     0.0885

-------------------------------------------------------------------------------------
                    |               Robust
         temp_above |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
        tech_ms_pca |   .1697832   .0723799     2.35   0.019     .0279213    .3116451
          info_cc_1 |   .0904984   .2179792     0.42   0.678     -.336733    .5177298
          info_cc_2 |  -.2877594   .1886639    -1.53   0.127    -.6575338     .082015
          info_cc_3 |  -.2094134   .2500178    -0.84   0.402    -.6994392    .2806124
          info_cc_4 |   -.381386   .2369956    -1.61   0.108    -.8458889    .0831169
          info_cc_5 |   .1230087   .2842161     0.43   0.665    -.4340446    .6800619
              orga2 |  -.2611809   .2900466    -0.90   0.368    -.8296618    .3073001
              orga3 |   .4913142   .2993969     1.64   0.101    -.0954929    1.078121
              orga4 |  -.2127532   .2721745    -0.78   0.434    -.7462055     .320699
      cops_attended |   .0180052   .0165393     1.09   0.276    -.0144111    .0504215
               edu1 |   .4414555   .2491947     1.77   0.076    -.0469571     .929868
               edu3 |   .4321317   .2986134     1.45   0.148    -.1531398    1.017403
               edu4 |   .1306974   .3794182     0.34   0.730    -.6129486    .8743433
               edu5 |  -.0604492   .4114775    -0.15   0.883    -.8669303    .7460319
lower_middle_income |   .0724626   .2598137     0.28   0.780     -.436763    .5816881
upper_middle_income |   .4493416   .2926866     1.54   0.125    -.1243136    1.022997
        high_income |   .1210854   .2913667     0.42   0.678    -.4499828    .6921537
         treat_tech |   .0316697   .1789642     0.18   0.860    -.3190937    .3824331
              _cons |  -.8806769   .4421192    -1.99   0.046    -1.747215   -.0141393
-------------------------------------------------------------------------------------

. local pR2 = e(r2_p)

. testparm $info_source 

 ( 1)  [temp_above]info_cc_1 = 0
 ( 2)  [temp_above]info_cc_2 = 0
 ( 3)  [temp_above]info_cc_3 = 0
 ( 4)  [temp_above]info_cc_4 = 0
 ( 5)  [temp_above]info_cc_5 = 0

           chi2(  5) =    6.74
         Prob > chi2 =    0.2407

. local F1 = r(p)

. testparm $orga

 ( 1)  [temp_above]orga2 = 0
 ( 2)  [temp_above]orga3 = 0
 ( 3)  [temp_above]orga4 = 0

           chi2(  3) =    5.13
         Prob > chi2 =    0.1627

. local F2 = r(p)

. testparm $socioeconomics

 ( 1)  [temp_above]edu1 = 0
 ( 2)  [temp_above]edu3 = 0
 ( 3)  [temp_above]edu4 = 0
 ( 4)  [temp_above]edu5 = 0

           chi2(  4) =    4.67
         Prob > chi2 =    0.3234

. local F3 = r(p)

. testparm $countryspecifics

 ( 1)  [temp_above]lower_middle_income = 0
 ( 2)  [temp_above]upper_middle_income = 0
 ( 3)  [temp_above]high_income = 0

           chi2(  3) =    3.19
         Prob > chi2 =    0.3638

. local F4 = r(p)

. margins , dydx(*) post

Average marginal effects                        Number of obs     =        277
Model VCE    : Robust

Expression   : Pr(temp_above), predict()
dy/dx w.r.t. : tech_ms_pca info_cc_1 info_cc_2 info_cc_3 info_cc_4 info_cc_5 orga2 orga3
               orga4 cops_attended edu1 edu3 edu4 edu5 lower_middle_income
               upper_middle_income high_income treat_tech

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
        tech_ms_pca |   .0456232   .0190947     2.39   0.017     .0081983     .083048
          info_cc_1 |   .0243182   .0585003     0.42   0.678    -.0903403    .1389768
          info_cc_2 |  -.0773251    .050047    -1.55   0.122    -.1754153    .0207652
          info_cc_3 |  -.0562724   .0668218    -0.84   0.400    -.1872408     .074696
          info_cc_4 |  -.1024839   .0633975    -1.62   0.106    -.2267407     .021773
          info_cc_5 |   .0330542   .0763161     0.43   0.665    -.1165226     .182631
              orga2 |   -.070183    .077901    -0.90   0.368    -.2228663    .0825002
              orga3 |   .1320232   .0793105     1.66   0.096    -.0234226    .2874689
              orga4 |  -.0571698     .07321    -0.78   0.435    -.2006587     .086319
      cops_attended |   .0048383    .004434     1.09   0.275    -.0038521    .0135286
               edu1 |   .1186254   .0666049     1.78   0.075    -.0119178    .2491686
               edu3 |     .11612   .0799985     1.45   0.147    -.0406741    .2729141
               edu4 |   .0351203   .1020075     0.34   0.731    -.1648108    .2350513
               edu5 |  -.0162436   .1105242    -0.15   0.883    -.2328671    .2003799
lower_middle_income |   .0194717   .0697982     0.28   0.780    -.1173302    .1562736
upper_middle_income |   .1207445   .0781124     1.55   0.122     -.032353     .273842
        high_income |   .0325374   .0783447     0.42   0.678    -.1210154    .1860902
         treat_tech |   .0085101   .0481229     0.18   0.860    -.0858091    .1028293
-------------------------------------------------------------------------------------

. outreg2 using "$working_ANALYSIS/results/tables/Table S4.doc", ///
> addstat("Pseudo R2", `pR2', "Information sources", `F1', "Organization working for", `F2', "
> Socioeconomics", `F3', "Country-level", `F4') adec(3) word ctitle("Temp. rise > 1.5°C") stat
> s(coef pval) dec(3) bdec(2)  replace
C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_Submis
> sion\replication_delegates/results/tables/Table S4.doc
dir : seeout

. 
. * Col 2: Quasi-continious model 
. reg temp_rise tech_ms_pca  $info_source $orga cops_attended $socioeconomics $countryspecific
> s treat_tech, vce(robust)

Linear regression                               Number of obs     =        277
                                                F(18, 258)        =       1.45
                                                Prob > F          =     0.1083
                                                R-squared         =     0.1020
                                                Root MSE          =     .81277

-------------------------------------------------------------------------------------
                    |               Robust
          temp_rise |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
        tech_ms_pca |   .0692499   .0366908     1.89   0.060    -.0030017    .1415015
          info_cc_1 |  -.0554804   .1218399    -0.46   0.649    -.2954078     .184447
          info_cc_2 |  -.0836585   .1063723    -0.79   0.432     -.293127    .1258101
          info_cc_3 |  -.2028481   .1700325    -1.19   0.234    -.5376763    .1319802
          info_cc_4 |  -.1361591   .1706499    -0.80   0.426    -.4722032    .1998849
          info_cc_5 |   -.061055   .2062652    -0.30   0.767    -.4672327    .3451226
              orga2 |     .10423   .1690446     0.62   0.538    -.2286528    .4371129
              orga3 |   .4525199   .1804389     2.51   0.013     .0971994    .8078404
              orga4 |  -.0380179   .1603014    -0.24   0.813    -.3536838    .2776479
      cops_attended |  -.0067159   .0100799    -0.67   0.506    -.0265652    .0131334
               edu1 |   .3010611   .1225056     2.46   0.015      .059823    .5422993
               edu3 |    .293951   .1427309     2.06   0.040     .0128851    .5750169
               edu4 |   .2447209   .1996177     1.23   0.221    -.1483666    .6378084
               edu5 |  -.0115369   .1623125    -0.07   0.943    -.3311628    .3080891
lower_middle_income |   .0098514   .1531628     0.06   0.949    -.2917569    .3114597
upper_middle_income |   .3215228   .1844995     1.74   0.083    -.0417939    .6848396
        high_income |    .238394   .1925684     1.24   0.217    -.1408118    .6175999
         treat_tech |  -.0402895   .1041358    -0.39   0.699    -.2453538    .1647749
              _cons |    1.49377   .3183891     4.69   0.000     .8667974    2.120742
-------------------------------------------------------------------------------------

. local aR2 = e(r2_a)

. local df = e(df_r)

. testparm $info_source 

 ( 1)  info_cc_1 = 0
 ( 2)  info_cc_2 = 0
 ( 3)  info_cc_3 = 0
 ( 4)  info_cc_4 = 0
 ( 5)  info_cc_5 = 0

       F(  5,   258) =    0.74
            Prob > F =    0.5914

. local F1 = r(p)

. testparm $orga

 ( 1)  orga2 = 0
 ( 2)  orga3 = 0
 ( 3)  orga4 = 0

       F(  3,   258) =    2.55
            Prob > F =    0.0562

. local F2 = r(p)

. testparm $socioeconomics

 ( 1)  edu1 = 0
 ( 2)  edu3 = 0
 ( 3)  edu4 = 0
 ( 4)  edu5 = 0

       F(  4,   258) =    2.25
            Prob > F =    0.0639

. local F3 = r(p)

. testparm $countryspecifics

 ( 1)  lower_middle_income = 0
 ( 2)  upper_middle_income = 0
 ( 3)  high_income = 0

       F(  3,   258) =    1.89
            Prob > F =    0.1317

. local F4 = r(p)

. outreg2 using "$working_ANALYSIS/results/tables/Table S4.doc", ///
> addstat("Adjusted R2", `aR2', "Degrees of freedom", `df', "Information sources", `F1', "Orga
> nization working for", `F2', "Socioeconomics", `F3', "Country-level", `F4') adec(3) stats(co
> ef pval) dec(3) bdec(2) word ctitle("Temp. rise: 0 to 5°C") append
C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_Submis
> sion\replication_delegates/results/tables/Table S4.doc
dir : seeout

. 
. * Col 3: Binary model (winsorized mindset)
. probit temp_above tech_ms_pca_win $info_source $orga cops_attended $socioeconomics $countrys
> pecifics treat_tech, vce(robust)

Iteration 0:   log pseudolikelihood = -146.02941  
Iteration 1:   log pseudolikelihood = -132.94437  
Iteration 2:   log pseudolikelihood = -132.79281  
Iteration 3:   log pseudolikelihood = -132.79279  
Iteration 4:   log pseudolikelihood = -132.79279  

Probit regression                               Number of obs     =        277
                                                Wald chi2(18)     =      26.76
                                                Prob > chi2       =     0.0837
Log pseudolikelihood = -132.79279               Pseudo R2         =     0.0906

-------------------------------------------------------------------------------------
                    |               Robust
         temp_above |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
    tech_ms_pca_win |   .1888712   .0761493     2.48   0.013     .0396213     .338121
          info_cc_1 |   .0910873   .2185078     0.42   0.677    -.3371801    .5193547
          info_cc_2 |  -.2926566   .1889464    -1.55   0.121    -.6629847    .0776714
          info_cc_3 |   -.209269   .2511257    -0.83   0.405    -.7014663    .2829283
          info_cc_4 |  -.3846814   .2378174    -1.62   0.106     -.850795    .0814322
          info_cc_5 |   .1230001   .2846983     0.43   0.666    -.4349983    .6809984
              orga2 |  -.2603056   .2905629    -0.90   0.370    -.8297985    .3091872
              orga3 |    .500373   .3003574     1.67   0.096    -.0883166    1.089063
              orga4 |    -.21083   .2720187    -0.78   0.438    -.7439768    .3223168
      cops_attended |     .01811   .0165848     1.09   0.275    -.0143956    .0506156
               edu1 |   .4411278   .2495791     1.77   0.077    -.0480381    .9302938
               edu3 |   .4354735   .2986908     1.46   0.145    -.1499497    1.020897
               edu4 |   .1372936   .3796848     0.36   0.718    -.6068748    .8814621
               edu5 |  -.0720716   .4118268    -0.18   0.861    -.8792373    .7350941
lower_middle_income |   .0699887   .2600267     0.27   0.788    -.4396543    .5796316
upper_middle_income |   .4545275   .2924783     1.55   0.120    -.1187195    1.027775
        high_income |    .135229   .2918791     0.46   0.643    -.4368436    .7073016
         treat_tech |   .0333385   .1789363     0.19   0.852    -.3173701    .3840471
              _cons |  -.8879534   .4421172    -2.01   0.045    -1.754487   -.0214195
-------------------------------------------------------------------------------------

. local pR2 = e(r2_p)

. testparm $info_source 

 ( 1)  [temp_above]info_cc_1 = 0
 ( 2)  [temp_above]info_cc_2 = 0
 ( 3)  [temp_above]info_cc_3 = 0
 ( 4)  [temp_above]info_cc_4 = 0
 ( 5)  [temp_above]info_cc_5 = 0

           chi2(  5) =    6.84
         Prob > chi2 =    0.2325

. local F1 = r(p)

. testparm $orga

 ( 1)  [temp_above]orga2 = 0
 ( 2)  [temp_above]orga3 = 0
 ( 3)  [temp_above]orga4 = 0

           chi2(  3) =    5.20
         Prob > chi2 =    0.1576

. local F2 = r(p)

. testparm $socioeconomics

 ( 1)  [temp_above]edu1 = 0
 ( 2)  [temp_above]edu3 = 0
 ( 3)  [temp_above]edu4 = 0
 ( 4)  [temp_above]edu5 = 0

           chi2(  4) =    4.72
         Prob > chi2 =    0.3172

. local F3 = r(p)

. testparm $countryspecifics

 ( 1)  [temp_above]lower_middle_income = 0
 ( 2)  [temp_above]upper_middle_income = 0
 ( 3)  [temp_above]high_income = 0

           chi2(  3) =    3.27
         Prob > chi2 =    0.3521

. local F4 = r(p)

. margins , dydx(*) post

Average marginal effects                        Number of obs     =        277
Model VCE    : Robust

Expression   : Pr(temp_above), predict()
dy/dx w.r.t. : tech_ms_pca_win info_cc_1 info_cc_2 info_cc_3 info_cc_4 info_cc_5 orga2 orga3
               orga4 cops_attended edu1 edu3 edu4 edu5 lower_middle_income
               upper_middle_income high_income treat_tech

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
    tech_ms_pca_win |   .0506085   .0199926     2.53   0.011     .0114236    .0897933
          info_cc_1 |    .024407   .0584793     0.42   0.676    -.0902102    .1390243
          info_cc_2 |   -.078418    .049985    -1.57   0.117    -.1763869    .0195508
          info_cc_3 |  -.0560741   .0669369    -0.84   0.402     -.187268    .0751198
          info_cc_4 |  -.1030763   .0634169    -1.63   0.104    -.2273711    .0212185
          info_cc_5 |   .0329582   .0762261     0.43   0.665    -.1164422    .1823585
              orga2 |  -.0697495    .077825    -0.90   0.370    -.2222838    .0827848
              orga3 |   .1340761   .0793385     1.69   0.091    -.0214245    .2895767
              orga4 |  -.0564924   .0729646    -0.77   0.439    -.1995005    .0865157
      cops_attended |   .0048526    .004434     1.09   0.274     -.003838    .0135432
               edu1 |   .1182012   .0665562     1.78   0.076    -.0122465    .2486489
               edu3 |   .1166862   .0798121     1.46   0.144    -.0397426    .2731149
               edu4 |   .0367881   .1018147     0.36   0.718     -.162765    .2363413
               edu5 |  -.0193118   .1102867    -0.18   0.861    -.2354698    .1968462
lower_middle_income |   .0187536   .0696646     0.27   0.788    -.1177864    .1552936
upper_middle_income |   .1217917   .0778775     1.56   0.118    -.0308454    .2744288
        high_income |   .0362349   .0782676     0.46   0.643    -.1171667    .1896365
         treat_tech |   .0089331   .0479824     0.19   0.852    -.0851106    .1029769
-------------------------------------------------------------------------------------

. outreg2 using "$working_ANALYSIS/results/tables/Table S4.doc", ///
> addstat("Pseudo R2", `pR2', "Information sources", `F1', "Organization working for", `F2', "
> Socioeconomics", `F3', "Country-level", `F4') adec(3) word ctitle("Temp. rise > 1.5°C") stat
> s(coef pval) dec(3) bdec(2)  append
C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_Submis
> sion\replication_delegates/results/tables/Table S4.doc
dir : seeout

. 
. * Col 4: Quasi-continious model (winsorized mindset)
. reg temp_rise tech_ms_pca_win $info_source $orga cops_attended $socioeconomics $countryspeci
> fics treat_tech, vce(robust)

Linear regression                               Number of obs     =        277
                                                F(18, 258)        =       1.48
                                                Prob > F          =     0.0958
                                                R-squared         =     0.1046
                                                Root MSE          =     .81164

-------------------------------------------------------------------------------------
                    |               Robust
          temp_rise |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
    tech_ms_pca_win |   .0822351   .0400969     2.05   0.041     .0032763    .1611939
          info_cc_1 |  -.0561618   .1213899    -0.46   0.644    -.2952029    .1828793
          info_cc_2 |  -.0856423   .1064012    -0.80   0.422    -.2951676    .1238831
          info_cc_3 |  -.2017022   .1696647    -1.19   0.236    -.5358062    .1324017
          info_cc_4 |  -.1391778   .1703196    -0.82   0.415    -.4745714    .1962159
          info_cc_5 |  -.0594165   .2055899    -0.29   0.773    -.4642643    .3454314
              orga2 |   .1056184   .1691735     0.62   0.533    -.2275182    .4387551
              orga3 |    .457843   .1801393     2.54   0.012     .1031125    .8125736
              orga4 |  -.0366323   .1592783    -0.23   0.818    -.3502834    .2770188
      cops_attended |   -.006783   .0100727    -0.67   0.501    -.0266181    .0130521
               edu1 |   .2984494   .1225431     2.44   0.016     .0571373    .5397615
               edu3 |   .2939404    .142786     2.06   0.041     .0127661    .5751147
               edu4 |   .2456982   .1987145     1.24   0.217    -.1456107    .6370071
               edu5 |  -.0216941   .1617834    -0.13   0.893    -.3402782      .29689
lower_middle_income |   .0065956   .1526953     0.04   0.966    -.2940922    .3072834
upper_middle_income |   .3212369   .1837325     1.75   0.082    -.0405694    .6830432
        high_income |   .2500304   .1921256     1.30   0.194    -.1283036    .6283644
         treat_tech |  -.0394916   .1039688    -0.38   0.704     -.244227    .1652439
              _cons |   1.492935   .3174078     4.70   0.000     .8678955    2.117975
-------------------------------------------------------------------------------------

. local aR2 = e(r2_a)

. local df = e(df_r)

. testparm $info_source 

 ( 1)  info_cc_1 = 0
 ( 2)  info_cc_2 = 0
 ( 3)  info_cc_3 = 0
 ( 4)  info_cc_4 = 0
 ( 5)  info_cc_5 = 0

       F(  5,   258) =    0.75
            Prob > F =    0.5843

. local F1 = r(p)

. testparm $orga

 ( 1)  orga2 = 0
 ( 2)  orga3 = 0
 ( 3)  orga4 = 0

       F(  3,   258) =    2.61
            Prob > F =    0.0517

. local F2 = r(p)

. testparm $socioeconomics

 ( 1)  edu1 = 0
 ( 2)  edu3 = 0
 ( 3)  edu4 = 0
 ( 4)  edu5 = 0

       F(  4,   258) =    2.29
            Prob > F =    0.0604

. local F3 = r(p)

. testparm $countryspecifics

 ( 1)  lower_middle_income = 0
 ( 2)  upper_middle_income = 0
 ( 3)  high_income = 0

       F(  3,   258) =    1.98
            Prob > F =    0.1176

. local F4 = r(p)

. outreg2 using "$working_ANALYSIS/results/tables/Table S4.doc", ///
> addstat("Adjusted R2", `aR2',  "Degrees of freedom", `df', "Information sources", `F1', "Org
> anization working for", `F2', "Socioeconomics", `F3', "Country-level", `F4')  adec(3) stats(
> coef pval) dec(3) bdec(2)  word ctitle("Temp. rise: 0 to 5°C") append
C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_Submis
> sion\replication_delegates/results/tables/Table S4.doc
dir : seeout

. 
. 
. * Col 5 & 6: Alternative thresholds (>2°C & >2.5°C)
. gen temp_above2 = 0

. replace temp_above2 = 1 if temp_rise > 2
(21 real changes made)

. gen temp_above3 = 0

. replace temp_above3 = 1 if temp_rise > 2.5
(12 real changes made)

. 
. global socioeconomics2 /*female age*/ edu1 edu3 edu4 

. 
. probit temp_above2 tech_ms_pca $info_source $orga cops_attended $socioeconomics2 $countryspe
> cifics treat_tech, vce(robust)

Iteration 0:   log pseudolikelihood = -74.352452  
Iteration 1:   log pseudolikelihood = -59.533578  
Iteration 2:   log pseudolikelihood = -57.710637  
Iteration 3:   log pseudolikelihood =  -57.68349  
Iteration 4:   log pseudolikelihood = -57.683488  

Probit regression                               Number of obs     =        277
                                                Wald chi2(17)     =      36.88
                                                Prob > chi2       =     0.0035
Log pseudolikelihood = -57.683488               Pseudo R2         =     0.2242

-------------------------------------------------------------------------------------
                    |               Robust
        temp_above2 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
        tech_ms_pca |   .2326976   .1146786     2.03   0.042     .0079317    .4574636
          info_cc_1 |  -.3824559   .2564001    -1.49   0.136    -.8849909    .1200792
          info_cc_2 |  -.0453087   .2381807    -0.19   0.849    -.5121342    .4215169
          info_cc_3 |  -.4403233    .343385    -1.28   0.200    -1.113345    .2326989
          info_cc_4 |   -.674349   .3126867    -2.16   0.031    -1.287204   -.0614944
          info_cc_5 |  -.1199639   .3400634    -0.35   0.724     -.786476    .5465481
              orga2 |   .7214947   .3789511     1.90   0.057    -.0212359    1.464225
              orga3 |   .7678246   .4133877     1.86   0.063    -.0424004     1.57805
              orga4 |   .3292111   .3993432     0.82   0.410    -.4534871    1.111909
      cops_attended |  -.0432779   .0292691    -1.48   0.139    -.1006443    .0140885
               edu1 |   .7570555   .4045309     1.87   0.061    -.0358105    1.549922
               edu3 |   .9264537   .4539513     2.04   0.041     .0367255    1.816182
               edu4 |    1.08704   .5581599     1.95   0.051    -.0069331    2.181013
lower_middle_income |  -.3217855    .340117    -0.95   0.344    -.9884025    .3448316
upper_middle_income |   .4211519    .401777     1.05   0.295    -.3663165     1.20862
        high_income |  -.3126918   .3967318    -0.79   0.431    -1.090272    .4648883
         treat_tech |    .345835   .2524245     1.37   0.171     -.148908     .840578
              _cons |  -1.132314   .5747341    -1.97   0.049    -2.258772   -.0058563
-------------------------------------------------------------------------------------

. local pR2 = e(r2_p)

. testparm $info_source 

 ( 1)  [temp_above2]info_cc_1 = 0
 ( 2)  [temp_above2]info_cc_2 = 0
 ( 3)  [temp_above2]info_cc_3 = 0
 ( 4)  [temp_above2]info_cc_4 = 0
 ( 5)  [temp_above2]info_cc_5 = 0

           chi2(  5) =   13.43
         Prob > chi2 =    0.0197

. local F1 = r(p)

. testparm $orga

 ( 1)  [temp_above2]orga2 = 0
 ( 2)  [temp_above2]orga3 = 0
 ( 3)  [temp_above2]orga4 = 0

           chi2(  3) =    5.49
         Prob > chi2 =    0.1394

. local F2 = r(p)

. testparm $socioeconomics2

 ( 1)  [temp_above2]edu1 = 0
 ( 2)  [temp_above2]edu3 = 0
 ( 3)  [temp_above2]edu4 = 0

           chi2(  3) =    5.27
         Prob > chi2 =    0.1532

. local F3 = r(p)

. testparm $countryspecifics

 ( 1)  [temp_above2]lower_middle_income = 0
 ( 2)  [temp_above2]upper_middle_income = 0
 ( 3)  [temp_above2]high_income = 0

           chi2(  3) =    5.99
         Prob > chi2 =    0.1122

. local F4 = r(p)

. margins , dydx(*) post

Average marginal effects                        Number of obs     =        277
Model VCE    : Robust

Expression   : Pr(temp_above2), predict()
dy/dx w.r.t. : tech_ms_pca info_cc_1 info_cc_2 info_cc_3 info_cc_4 info_cc_5 orga2 orga3
               orga4 cops_attended edu1 edu3 edu4 lower_middle_income upper_middle_income
               high_income treat_tech

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
        tech_ms_pca |   .0262635    .013029     2.02   0.044     .0007271    .0517999
          info_cc_1 |   -.043166   .0295457    -1.46   0.144    -.1010745    .0147425
          info_cc_2 |  -.0051138   .0268066    -0.19   0.849    -.0576537    .0474261
          info_cc_3 |  -.0496972   .0382982    -1.30   0.194    -.1247603    .0253659
          info_cc_4 |  -.0761106   .0357954    -2.13   0.033    -.1462683   -.0059529
          info_cc_5 |  -.0135398   .0386207    -0.35   0.726    -.0892349    .0621553
              orga2 |   .0814317     .04297     1.90   0.058    -.0027879    .1656514
              orga3 |   .0866608   .0448384     1.93   0.053    -.0012209    .1745424
              orga4 |   .0371565   .0440853     0.84   0.399     -.049249     .123562
      cops_attended |  -.0048846   .0031692    -1.54   0.123    -.0110961     .001327
               edu1 |   .0854453   .0457077     1.87   0.062    -.0041402    .1750308
               edu3 |   .1045645   .0509029     2.05   0.040     .0047967    .2043323
               edu4 |   .1226891   .0634772     1.93   0.053    -.0017239    .2471022
lower_middle_income |  -.0363184   .0394743    -0.92   0.358    -.1136867    .0410499
upper_middle_income |   .0475334   .0449662     1.06   0.290    -.0405988    .1356657
        high_income |   -.035292   .0454782    -0.78   0.438    -.1244276    .0538435
         treat_tech |   .0390328   .0287653     1.36   0.175    -.0173461    .0954117
-------------------------------------------------------------------------------------

. outreg2 using "$working_ANALYSIS/results/tables/Table S4.doc", ///
> addstat("Pseudo R2", `pR2', "Information sources", `F1', "Organization working for", `F2', "
> Socioeconomics", `F3', "Country-level", `F4')  adec(3) word ctitle("Temp. rise > 2°C") stats
> (coef pval) dec(3) bdec(2) append
C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_Submis
> sion\replication_delegates/results/tables/Table S4.doc
dir : seeout

. 
. probit temp_above3 tech_ms_pca $info_source $orga cops_attended $socioeconomics2 $countryspe
> cifics treat_tech, vce(robust)

Iteration 0:   log pseudolikelihood = -49.405566  
Iteration 1:   log pseudolikelihood = -37.959714  
Iteration 2:   log pseudolikelihood = -35.493269  
Iteration 3:   log pseudolikelihood = -35.405312  
Iteration 4:   log pseudolikelihood = -35.404953  
Iteration 5:   log pseudolikelihood = -35.404953  

Probit regression                               Number of obs     =        277
                                                Wald chi2(17)     =      43.22
                                                Prob > chi2       =     0.0004
Log pseudolikelihood = -35.404953               Pseudo R2         =     0.2834

-------------------------------------------------------------------------------------
                    |               Robust
        temp_above3 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
        tech_ms_pca |   .3832707   .1449044     2.64   0.008     .0992633     .667278
          info_cc_1 |  -.4964367   .3004785    -1.65   0.099    -1.085364    .0924903
          info_cc_2 |  -.4865911   .3071411    -1.58   0.113    -1.088576    .1153943
          info_cc_3 |   .0370451   .4426466     0.08   0.933    -.8305263    .9046165
          info_cc_4 |  -.5180057   .4097567    -1.26   0.206    -1.321114    .2851027
          info_cc_5 |  -.3113637   .3746752    -0.83   0.406    -1.045714    .4229862
              orga2 |   .7911993   .5077588     1.56   0.119    -.2039897    1.786388
              orga3 |   .7107888   .4917764     1.45   0.148    -.2530753    1.674653
              orga4 |   .6165748   .4968883     1.24   0.215    -.3573083    1.590458
      cops_attended |  -.0343836   .0309777    -1.11   0.267    -.0950987    .0263314
               edu1 |    .784115    .445654     1.76   0.078    -.0893507    1.657581
               edu3 |   1.320361   .5685995     2.32   0.020     .2059266    2.434796
               edu4 |   1.692492   .6367747     2.66   0.008     .4444366    2.940548
lower_middle_income |  -.7504575   .4004136    -1.87   0.061    -1.535254    .0343388
upper_middle_income |   .1624652   .4160884     0.39   0.696     -.653053    .9779834
        high_income |  -.1005358   .3972216    -0.25   0.800    -.8790758    .6780043
         treat_tech |  -.2720158   .3572161    -0.76   0.446    -.9721464    .4281148
              _cons |  -1.407951   .6886565    -2.04   0.041    -2.757693   -.0582096
-------------------------------------------------------------------------------------

. local pR2 = e(r2_p)

. testparm $info_source 

 ( 1)  [temp_above3]info_cc_1 = 0
 ( 2)  [temp_above3]info_cc_2 = 0
 ( 3)  [temp_above3]info_cc_3 = 0
 ( 4)  [temp_above3]info_cc_4 = 0
 ( 5)  [temp_above3]info_cc_5 = 0

           chi2(  5) =    8.60
         Prob > chi2 =    0.1261

. local F1 = r(p)

. testparm $orga

 ( 1)  [temp_above3]orga2 = 0
 ( 2)  [temp_above3]orga3 = 0
 ( 3)  [temp_above3]orga4 = 0

           chi2(  3) =    3.78
         Prob > chi2 =    0.2864

. local F2 = r(p)

. testparm $socioeconomics2

 ( 1)  [temp_above3]edu1 = 0
 ( 2)  [temp_above3]edu3 = 0
 ( 3)  [temp_above3]edu4 = 0

           chi2(  3) =    7.85
         Prob > chi2 =    0.0492

. local F3 = r(p)

. testparm $countryspecifics

 ( 1)  [temp_above3]lower_middle_income = 0
 ( 2)  [temp_above3]upper_middle_income = 0
 ( 3)  [temp_above3]high_income = 0

           chi2(  3) =    6.75
         Prob > chi2 =    0.0803

. local F4 = r(p)

. margins , dydx(*) post

Average marginal effects                        Number of obs     =        277
Model VCE    : Robust

Expression   : Pr(temp_above3), predict()
dy/dx w.r.t. : tech_ms_pca info_cc_1 info_cc_2 info_cc_3 info_cc_4 info_cc_5 orga2 orga3
               orga4 cops_attended edu1 edu3 edu4 lower_middle_income upper_middle_income
               high_income treat_tech

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
        tech_ms_pca |   .0262228   .0093302     2.81   0.005      .007936    .0445096
          info_cc_1 |  -.0339655   .0212827    -1.60   0.111    -.0756788    .0077479
          info_cc_2 |  -.0332918   .0198417    -1.68   0.093    -.0721808    .0055971
          info_cc_3 |   .0025346    .030253     0.08   0.933    -.0567601    .0618293
          info_cc_4 |  -.0354412   .0279628    -1.27   0.205    -.0902473     .019365
          info_cc_5 |   -.021303   .0259743    -0.82   0.412    -.0722117    .0296056
              orga2 |   .0541327   .0344845     1.57   0.116    -.0134557    .1217211
              orga3 |   .0486311   .0338523     1.44   0.151    -.0177182    .1149805
              orga4 |   .0421851   .0325532     1.30   0.195    -.0216179    .1059881
      cops_attended |  -.0023525   .0021634    -1.09   0.277    -.0065926    .0018877
               edu1 |    .053648   .0339977     1.58   0.115    -.0129863    .1202823
               edu3 |   .0903372   .0403966     2.24   0.025     .0111613     .169513
               edu4 |   .1157978   .0469338     2.47   0.014     .0238093    .2077863
lower_middle_income |  -.0513452   .0291484    -1.76   0.078     -.108475    .0057846
upper_middle_income |   .0111156    .029038     0.38   0.702    -.0457978     .068029
        high_income |  -.0068785   .0274491    -0.25   0.802    -.0606778    .0469207
         treat_tech |  -.0186109   .0238852    -0.78   0.436    -.0654251    .0282032
-------------------------------------------------------------------------------------

. outreg2 using "$working_ANALYSIS/results/tables/Table S4.doc", ///
>  addstat("Pseudo R2", `pR2', "Information sources", `F1', "Organization working for", `F2', 
> "Socioeconomics", `F3', "Country-level", `F4')  adec(3) word ctitle("Temp. rise > 2.5°C") st
> ats(coef pval) dec(3) bdec(2) append
C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_Submis
> sion\replication_delegates/results/tables/Table S4.doc
dir : seeout

. 
. 
. 
. 
. 
. // S4.2 Carbon prices suggested 
. 
. // S4.2.1 Global carbon prices suggested to reach stated temperature target
. 
. * Table S5. Effects of technological optimism mindset on global carbon price deemed necessar
> y to reach stated temperature target
. * Col 1: Binary Model [Price deemed appropriate to reach temperature target < 60 USD]
. probit price_below temp_rise tech_ms_pca $info_source $orga cops_attended $socioeconomics $c
> ountryspecifics treat_tech, vce(robust)

Iteration 0:   log pseudolikelihood = -190.87207  
Iteration 1:   log pseudolikelihood = -151.74948  
Iteration 2:   log pseudolikelihood = -151.30623  
Iteration 3:   log pseudolikelihood = -151.30493  
Iteration 4:   log pseudolikelihood = -151.30493  

Probit regression                               Number of obs     =        277
                                                Wald chi2(19)     =      65.28
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -151.30493               Pseudo R2         =     0.2073

-------------------------------------------------------------------------------------
                    |               Robust
        price_below |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          temp_rise |  -.0049125   .1035729    -0.05   0.962    -.2079116    .1980866
        tech_ms_pca |     .19897   .0680015     2.93   0.003     .0656895    .3322505
          info_cc_1 |   .1042631   .2161849     0.48   0.630    -.3194515    .5279777
          info_cc_2 |   -.205331   .1868584    -1.10   0.272    -.5715668    .1609048
          info_cc_3 |   -.221389   .2686229    -0.82   0.410    -.7478802    .3051023
          info_cc_4 |  -.1823137   .2444169    -0.75   0.456     -.661362    .2967347
          info_cc_5 |  -.1749935   .2862667    -0.61   0.541    -.7360659    .3860789
              orga2 |   .2309284   .3008308     0.77   0.443    -.3586892     .820546
              orga3 |   .2447222   .3016543     0.81   0.417    -.3465094    .8359538
              orga4 |   .3105514   .2463206     1.26   0.207    -.1722281     .793331
      cops_attended |   .0481295   .0148358     3.24   0.001     .0190518    .0772072
               edu1 |  -.3689572   .2275455    -1.62   0.105    -.8149382    .0770238
               edu3 |  -.3634264    .283724    -1.28   0.200    -.9195153    .1926625
               edu4 |   -.797853   .3271201    -2.44   0.015    -1.438997   -.1567094
               edu5 |  -.2040163   .3195318    -0.64   0.523    -.8302872    .4222546
lower_middle_income |   .0315215    .242884     0.13   0.897    -.4445224    .5075654
upper_middle_income |    .352593   .2973415     1.19   0.236    -.2301856    .9353715
        high_income |  -.9682344   .3034501    -3.19   0.001    -1.562986   -.3734831
         treat_tech |  -.4550467   .1724113    -2.64   0.008    -.7929666   -.1171269
              _cons |   1.021398   .4316568     2.37   0.018      .175366     1.86743
-------------------------------------------------------------------------------------

. local pR2 = e(r2_p)

. testparm $info_source 

 ( 1)  [price_below]info_cc_1 = 0
 ( 2)  [price_below]info_cc_2 = 0
 ( 3)  [price_below]info_cc_3 = 0
 ( 4)  [price_below]info_cc_4 = 0
 ( 5)  [price_below]info_cc_5 = 0

           chi2(  5) =    3.95
         Prob > chi2 =    0.5561

. local F1 = r(p)

. testparm $orga

 ( 1)  [price_below]orga2 = 0
 ( 2)  [price_below]orga3 = 0
 ( 3)  [price_below]orga4 = 0

           chi2(  3) =    2.19
         Prob > chi2 =    0.5335

. local F2 = r(p)

. testparm $socioeconomics

 ( 1)  [price_below]edu1 = 0
 ( 2)  [price_below]edu3 = 0
 ( 3)  [price_below]edu4 = 0
 ( 4)  [price_below]edu5 = 0

           chi2(  4) =    6.56
         Prob > chi2 =    0.1612

. local F3 = r(p)

. testparm $countryspecifics

 ( 1)  [price_below]lower_middle_income = 0
 ( 2)  [price_below]upper_middle_income = 0
 ( 3)  [price_below]high_income = 0

           chi2(  3) =   24.08
         Prob > chi2 =    0.0000

. local F4 = r(p)

. margins , dydx(*) post

Average marginal effects                        Number of obs     =        277
Model VCE    : Robust

Expression   : Pr(price_below), predict()
dy/dx w.r.t. : temp_rise tech_ms_pca info_cc_1 info_cc_2 info_cc_3 info_cc_4 info_cc_5 orga2
               orga3 orga4 cops_attended edu1 edu3 edu4 edu5 lower_middle_income
               upper_middle_income high_income treat_tech

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          temp_rise |    -.00152   .0320412    -0.05   0.962    -.0643195    .0612796
        tech_ms_pca |   .0615635   .0200735     3.07   0.002     .0222202    .1009068
          info_cc_1 |   .0322601   .0668525     0.48   0.629    -.0987683    .1632886
          info_cc_2 |  -.0635317   .0574257    -1.11   0.269     -.176084    .0490206
          info_cc_3 |  -.0685002   .0824121    -0.83   0.406     -.230025    .0930246
          info_cc_4 |  -.0564099   .0754495    -0.75   0.455    -.2042881    .0914684
          info_cc_5 |  -.0541449   .0885189    -0.61   0.541    -.2276388    .1193489
              orga2 |   .0714518   .0925058     0.77   0.440    -.1098562    .2527598
              orga3 |   .0757197   .0930387     0.81   0.416    -.1066328    .2580722
              orga4 |    .096088   .0756126     1.27   0.204    -.0521099     .244286
      cops_attended |   .0148918    .004444     3.35   0.001     .0061818    .0236018
               edu1 |  -.1141594   .0695911    -1.64   0.101    -.2505555    .0222366
               edu3 |  -.1124481   .0870261    -1.29   0.196    -.2830161    .0581198
               edu4 |  -.2468645   .0998676    -2.47   0.013    -.4426014   -.0511276
               edu5 |  -.0631249   .0989022    -0.64   0.523    -.2569697    .1307199
lower_middle_income |   .0097531   .0751439     0.13   0.897    -.1375262    .1570325
upper_middle_income |   .1090962   .0910222     1.20   0.231    -.0693041    .2874964
        high_income |  -.2995824   .0892245    -3.36   0.001    -.4744592   -.1247056
         treat_tech |  -.1407965   .0517869    -2.72   0.007    -.2422969   -.0392961
-------------------------------------------------------------------------------------

. outreg2 using "$working_ANALYSIS/results/tables/Table S5.doc", ///
> addstat("Pseudo R2", `pR2', "Information sources", `F1', "Organization working for", `F2', "
> Socioeconomics", `F3', "Country-level", `F4')  adec(3) word ctitle("Global carbon price < 60
> USD") stats(coef pval) dec(3) bdec(2) replace
C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_Submis
> sion\replication_delegates/results/tables/Table S5.doc
dir : seeout

. 
. * Col 2: Continious model [LN Price]
. reg ln_carbon_price temp_rise tech_ms_pca $info_source $orga cops_attended $socioeconomics $
> countryspecifics treat_tech, vce(robust)

Linear regression                               Number of obs     =        277
                                                F(19, 257)        =       4.45
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1654
                                                Root MSE          =     1.5573

-------------------------------------------------------------------------------------
                    |               Robust
    ln_carbon_price |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          temp_rise |  -.0144695   .1220318    -0.12   0.906    -.2547792    .2258402
        tech_ms_pca |   -.220156   .0755863    -2.91   0.004    -.3690034   -.0713086
          info_cc_1 |  -.1507814   .2695129    -0.56   0.576    -.6815162    .3799535
          info_cc_2 |  -.0116575   .2120349    -0.05   0.956    -.4292047    .4058897
          info_cc_3 |   .4024386   .3507476     1.15   0.252    -.2882668    1.093144
          info_cc_4 |   .0747611   .2823153     0.26   0.791    -.4811849     .630707
          info_cc_5 |   .1104939   .3145174     0.35   0.726    -.5088655    .7298534
              orga2 |   .0264287    .295381     0.09   0.929    -.5552466    .6081041
              orga3 |   .0349042   .3740673     0.09   0.926    -.7017231    .7715316
              orga4 |  -.0702304   .2661814    -0.26   0.792    -.5944048     .453944
      cops_attended |  -.0447166   .0151675    -2.95   0.003     -.074585   -.0148482
               edu1 |   .1758038   .2742122     0.64   0.522    -.3641852    .7157927
               edu3 |   .5109216   .3462757     1.48   0.141    -.1709775    1.192821
               edu4 |   .2881248   .3494329     0.82   0.410    -.3999915    .9762412
               edu5 |   .1969233    .354409     0.56   0.579    -.5009921    .8948388
lower_middle_income |  -.1833489   .3417802    -0.54   0.592    -.8563952    .4896975
upper_middle_income |  -.0695196   .3546342    -0.20   0.845    -.7678786    .6288393
        high_income |   .6903467   .3489805     1.98   0.049     .0031212    1.377572
         treat_tech |   .3247996    .195288     1.66   0.097    -.0597689     .709368
              _cons |   3.341065   .5281028     6.33   0.000     2.301105    4.381025
-------------------------------------------------------------------------------------

. local aR2 = e(r2_a)

. local df = e(df_r)

. testparm $info_source 

 ( 1)  info_cc_1 = 0
 ( 2)  info_cc_2 = 0
 ( 3)  info_cc_3 = 0
 ( 4)  info_cc_4 = 0
 ( 5)  info_cc_5 = 0

       F(  5,   257) =    0.46
            Prob > F =    0.8035

. local F1 = r(p)

. testparm $orga

 ( 1)  orga2 = 0
 ( 2)  orga3 = 0
 ( 3)  orga4 = 0

       F(  3,   257) =    0.03
            Prob > F =    0.9920

. local F2 = r(p)

. testparm $socioeconomics

 ( 1)  edu1 = 0
 ( 2)  edu3 = 0
 ( 3)  edu4 = 0
 ( 4)  edu5 = 0

       F(  4,   257) =    0.57
            Prob > F =    0.6852

. local F3 = r(p)

. testparm $countryspecifics

 ( 1)  lower_middle_income = 0
 ( 2)  upper_middle_income = 0
 ( 3)  high_income = 0

       F(  3,   257) =    5.59
            Prob > F =    0.0010

. local F4 = r(p)

. outreg2 using"$working_ANALYSIS/results/tables/Table S5.doc", ///
> addstat("Adjusted R2", `aR2',  "Degrees of freedom", `df', "Information sources", `F1', "Org
> anization working for", `F2', "Socioeconomics", `F3', "Country-level", `F4') adec(3) word ct
> itle("Global carbon price ln, USD") stats(coef pval) dec(3) bdec(2) append
C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_Submis
> sion\replication_delegates/results/tables/Table S5.doc
dir : seeout

. 
. * Col 3: Binary Model Winsorized [Price deemed appropriate to reach temperature target < 60 
> USD]
. probit price_below temp_rise tech_ms_pca_win $info_source $orga cops_attended $socioeconomic
> s $countryspecifics treat_tech, vce(robust)

Iteration 0:   log pseudolikelihood = -190.87207  
Iteration 1:   log pseudolikelihood = -152.09183  
Iteration 2:   log pseudolikelihood = -151.65561  
Iteration 3:   log pseudolikelihood = -151.65435  
Iteration 4:   log pseudolikelihood = -151.65435  

Probit regression                               Number of obs     =        277
                                                Wald chi2(19)     =      64.93
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -151.65435               Pseudo R2         =     0.2055

-------------------------------------------------------------------------------------
                    |               Robust
        price_below |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          temp_rise |  -.0059476   .1038314    -0.06   0.954    -.2094533    .1975582
    tech_ms_pca_win |   .2064571   .0741187     2.79   0.005     .0611871    .3517271
          info_cc_1 |   .0961285   .2159456     0.45   0.656     -.327117     .519374
          info_cc_2 |  -.2081716   .1866916    -1.12   0.265    -.5740804    .1577373
          info_cc_3 |   -.224074   .2684328    -0.83   0.404    -.7501926    .3020446
          info_cc_4 |  -.1836941   .2442611    -0.75   0.452    -.6624371    .2950489
          info_cc_5 |  -.1694995   .2853978    -0.59   0.553    -.7288688    .3898698
              orga2 |   .2396163   .3012215     0.80   0.426     -.350767    .8299996
              orga3 |    .252439   .3021936     0.84   0.404    -.3398495    .8447275
              orga4 |   .3126113   .2456419     1.27   0.203     -.168838    .7940607
      cops_attended |   .0475788   .0148026     3.21   0.001     .0185662    .0765913
               edu1 |  -.3638661   .2268022    -1.60   0.109    -.8083903    .0806581
               edu3 |  -.3579639   .2828387    -1.27   0.206    -.9123175    .1963898
               edu4 |  -.7945301   .3265344    -2.43   0.015    -1.434526   -.1545344
               edu5 |  -.2375111   .3205852    -0.74   0.459    -.8658466    .3908245
lower_middle_income |   .0293818   .2426023     0.12   0.904      -.44611    .5048737
upper_middle_income |   .3449762   .2967603     1.16   0.245    -.2366634    .9266158
        high_income |  -.9682741   .3044445    -3.18   0.001    -1.564974   -.3715738
         treat_tech |  -.4466516   .1719354    -2.60   0.009    -.7836387   -.1096645
              _cons |   1.021071   .4318579     2.36   0.018     .1746453    1.867497
-------------------------------------------------------------------------------------

. local pR2 = e(r2_p)

. testparm $info_source 

 ( 1)  [price_below]info_cc_1 = 0
 ( 2)  [price_below]info_cc_2 = 0
 ( 3)  [price_below]info_cc_3 = 0
 ( 4)  [price_below]info_cc_4 = 0
 ( 5)  [price_below]info_cc_5 = 0

           chi2(  5) =    4.00
         Prob > chi2 =    0.5488

. local F1 = r(p)

. testparm $orga

 ( 1)  [price_below]orga2 = 0
 ( 2)  [price_below]orga3 = 0
 ( 3)  [price_below]orga4 = 0

           chi2(  3) =    2.27
         Prob > chi2 =    0.5182

. local F2 = r(p)

. testparm $socioeconomics

 ( 1)  [price_below]edu1 = 0
 ( 2)  [price_below]edu3 = 0
 ( 3)  [price_below]edu4 = 0
 ( 4)  [price_below]edu5 = 0

           chi2(  4) =    6.43
         Prob > chi2 =    0.1691

. local F3 = r(p)

. testparm $countryspecifics

 ( 1)  [price_below]lower_middle_income = 0
 ( 2)  [price_below]upper_middle_income = 0
 ( 3)  [price_below]high_income = 0

           chi2(  3) =   23.66
         Prob > chi2 =    0.0000

. local F4 = r(p)

. margins , dydx(*) post

Average marginal effects                        Number of obs     =        277
Model VCE    : Robust

Expression   : Pr(price_below), predict()
dy/dx w.r.t. : temp_rise tech_ms_pca_win info_cc_1 info_cc_2 info_cc_3 info_cc_4 info_cc_5
               orga2 orga3 orga4 cops_attended edu1 edu3 edu4 edu5 lower_middle_income
               upper_middle_income high_income treat_tech

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          temp_rise |  -.0018446   .0321959    -0.06   0.954    -.0649475    .0612582
    tech_ms_pca_win |   .0640326   .0220163     2.91   0.004     .0208814    .1071837
          info_cc_1 |   .0298142   .0669486     0.45   0.656    -.1014026     .161031
          info_cc_2 |  -.0645643   .0575091    -1.12   0.262      -.17728    .0481514
          info_cc_3 |  -.0694964   .0825292    -0.84   0.400    -.2312508    .0922579
          info_cc_4 |  -.0569726   .0755897    -0.75   0.451    -.2051258    .0911805
          info_cc_5 |  -.0525702    .088477    -0.59   0.552    -.2259819    .1208415
              orga2 |   .0743169   .0928196     0.80   0.423    -.1076061    .2562399
              orga3 |   .0782938   .0933953     0.84   0.402    -.1047575    .2613452
              orga4 |   .0969562   .0755833     1.28   0.200    -.0511844    .2450968
      cops_attended |   .0147565   .0044458     3.32   0.001      .006043    .0234701
               edu1 |  -.1128529   .0695725    -1.62   0.105    -.2492124    .0235066
               edu3 |  -.1110223   .0869608    -1.28   0.202    -.2814623    .0594177
               edu4 |  -.2464231   .0999222    -2.47   0.014     -.442267   -.0505791
               edu5 |  -.0736639   .0994358    -0.74   0.459    -.2685546    .1212267
lower_middle_income |   .0091128   .0752358     0.12   0.904    -.1383466    .1565721
upper_middle_income |   .1069942   .0910668     1.17   0.240    -.0714935    .2854819
        high_income |  -.3003097   .0898798    -3.34   0.001    -.4764709   -.1241485
         treat_tech |  -.1385287   .0517984    -2.67   0.007    -.2400517   -.0370058
-------------------------------------------------------------------------------------

. outreg2 using "$working_ANALYSIS/results/tables/Table S5.doc", ///
> addstat("Pseudo R2", `pR2', "Information sources", `F1', "Organization working for", `F2', "
> Socioeconomics", `F3', "Country-level", `F4')  adec(3) word ctitle("Global carbon price < 60
> USD") stats(coef pval) dec(3) bdec(2) append
C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_Submis
> sion\replication_delegates/results/tables/Table S5.doc
dir : seeout

. 
. * Col 4: Continious model Winsorized [Log price]
. reg ln_carbon_price temp_rise tech_ms_pca_win $info_source $orga cops_attended $socioeconomi
> cs $countryspecifics treat_tech, vce(robust)

Linear regression                               Number of obs     =        277
                                                F(19, 257)        =       4.46
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1651
                                                Root MSE          =     1.5576

-------------------------------------------------------------------------------------
                    |               Robust
    ln_carbon_price |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          temp_rise |  -.0104569   .1222605    -0.09   0.932    -.2512169     .230303
    tech_ms_pca_win |   -.236752   .0836316    -2.83   0.005    -.4014426   -.0720615
          info_cc_1 |  -.1437558   .2697906    -0.53   0.595    -.6750375    .3875259
          info_cc_2 |  -.0079596   .2121965    -0.04   0.970    -.4258249    .4099056
          info_cc_3 |   .4055346   .3502046     1.16   0.248    -.2841015    1.095171
          info_cc_4 |   .0775516   .2821465     0.27   0.784    -.4780619     .633165
          info_cc_5 |   .1025745   .3145017     0.33   0.745    -.5167539     .721903
              orga2 |    .018027   .2962397     0.06   0.952    -.5653394    .6013934
              orga3 |   .0212654   .3737043     0.06   0.955    -.7146472     .757178
              orga4 |  -.0709476   .2664157    -0.27   0.790    -.5955833    .4536881
      cops_attended |  -.0442856   .0151355    -2.93   0.004     -.074091   -.0144802
               edu1 |   .1705555   .2731051     0.62   0.533    -.3672532    .7083643
               edu3 |   .5061082   .3458174     1.46   0.145    -.1748883    1.187105
               edu4 |   .2834719   .3490968     0.81   0.418    -.4039826    .9709264
               edu5 |   .2268749   .3547069     0.64   0.523    -.4716271     .925377
lower_middle_income |  -.1796285   .3421412    -0.53   0.600    -.8533857    .4941286
upper_middle_income |  -.0662696   .3549933    -0.19   0.852    -.7653357    .6327966
        high_income |   .6808289   .3510895     1.94   0.054    -.0105497    1.372208
         treat_tech |   .3180803   .1952799     1.63   0.105    -.0664721    .7026328
              _cons |   3.341242   .5277665     6.33   0.000     2.301945     4.38054
-------------------------------------------------------------------------------------

. local aR2 = e(r2_a)

. local df = e(df_r)

. testparm $info_source 

 ( 1)  info_cc_1 = 0
 ( 2)  info_cc_2 = 0
 ( 3)  info_cc_3 = 0
 ( 4)  info_cc_4 = 0
 ( 5)  info_cc_5 = 0

       F(  5,   257) =    0.46
            Prob > F =    0.8041

. local F1 = r(p)

. testparm $orga

 ( 1)  orga2 = 0
 ( 2)  orga3 = 0
 ( 3)  orga4 = 0

       F(  3,   257) =    0.03
            Prob > F =    0.9933

. local F2 = r(p)

. testparm $socioeconomics

 ( 1)  edu1 = 0
 ( 2)  edu3 = 0
 ( 3)  edu4 = 0
 ( 4)  edu5 = 0

       F(  4,   257) =    0.56
            Prob > F =    0.6901

. local F3 = r(p)

. testparm $countryspecifics

 ( 1)  lower_middle_income = 0
 ( 2)  upper_middle_income = 0
 ( 3)  high_income = 0

       F(  3,   257) =    5.24
            Prob > F =    0.0016

. local F4 = r(p)

. outreg2 using"$working_ANALYSIS/results/tables/Table S5.doc", ///
> addstat("Adjusted R2", `aR2',  "Degrees of freedom", `df', "Information sources", `F1', "Org
> anization working for", `F2', "Socioeconomics", `F3', "Country-level", `F4') adec(3) word ct
> itle("Global carbon price ln, USD") stats(coef pval) dec(3) bdec(2) append
C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_Submis
> sion\replication_delegates/results/tables/Table S5.doc
dir : seeout

. 
. 
. 
. ** Table S6. Effects of technological optimism mindset on global carbon prices using differe
> nt thresholds in the binary model
. * Col 1: Price < USD37
. probit price_below_37 temp_rise tech_ms_pca $info_source $orga cops_attended $socioeconomics
>  $countryspecifics treat_tech, vce(robust)

Iteration 0:   log pseudolikelihood = -189.24714  
Iteration 1:   log pseudolikelihood = -149.90157  
Iteration 2:   log pseudolikelihood = -149.41696  
Iteration 3:   log pseudolikelihood = -149.41677  
Iteration 4:   log pseudolikelihood = -149.41677  

Probit regression                               Number of obs     =        277
                                                Wald chi2(19)     =      64.34
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -149.41677               Pseudo R2         =     0.2105

-------------------------------------------------------------------------------------
                    |               Robust
     price_below_37 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          temp_rise |  -.0451099   .1032646    -0.44   0.662    -.2475048    .1572849
        tech_ms_pca |   .2681293   .0718664     3.73   0.000     .1272738    .4089848
          info_cc_1 |   .1808459   .2082612     0.87   0.385    -.2273386    .5890304
          info_cc_2 |  -.0472106   .1897417    -0.25   0.804    -.4190976    .3246764
          info_cc_3 |  -.3863266   .2603644    -1.48   0.138    -.8966316    .1239783
          info_cc_4 |  -.2394861   .2404966    -1.00   0.319    -.7108508    .2318785
          info_cc_5 |  -.2241096   .2894479    -0.77   0.439    -.7914171    .3431979
              orga2 |  -.3067029   .2744173    -1.12   0.264    -.8445509    .2311451
              orga3 |   .4888275   .2897774     1.69   0.092    -.0791258    1.056781
              orga4 |   .0303024   .2583855     0.12   0.907    -.4761238    .5367287
      cops_attended |   .0537073   .0155864     3.45   0.001     .0231585    .0842561
               edu1 |   .1146598   .2278459     0.50   0.615    -.3319101    .5612296
               edu3 |  -.2300831   .2817708    -0.82   0.414    -.7823438    .3221776
               edu4 |  -.2431252   .3385629    -0.72   0.473    -.9066963    .4204459
               edu5 |   .0486524   .3390902     0.14   0.886    -.6159522     .713257
lower_middle_income |  -.0931511   .2375732    -0.39   0.695    -.5587859    .3724838
upper_middle_income |   .1718723   .2815521     0.61   0.542    -.3799596    .7237042
        high_income |  -1.164989    .318211    -3.66   0.000    -1.788671   -.5413072
         treat_tech |  -.2451709   .1760138    -1.39   0.164    -.5901516    .0998098
              _cons |   .5048124   .4348852     1.16   0.246     -.347547    1.357172
-------------------------------------------------------------------------------------

. local r2_p = e(r2_p)

. eststo table_6_1: margins, dydx(*) post

Average marginal effects                        Number of obs     =        277
Model VCE    : Robust

Expression   : Pr(price_below_37), predict()
dy/dx w.r.t. : temp_rise tech_ms_pca info_cc_1 info_cc_2 info_cc_3 info_cc_4 info_cc_5 orga2
               orga3 orga4 cops_attended edu1 edu3 edu4 edu5 lower_middle_income
               upper_middle_income high_income treat_tech

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          temp_rise |  -.0138033   .0316179    -0.44   0.662    -.0757732    .0481667
        tech_ms_pca |   .0820454   .0202414     4.05   0.000     .0423731    .1217178
          info_cc_1 |   .0553374   .0636376     0.87   0.385    -.0693899    .1800647
          info_cc_2 |  -.0144461   .0580207    -0.25   0.803    -.1281645    .0992723
          info_cc_3 |  -.1182129    .078502    -1.51   0.132    -.2720739    .0356481
          info_cc_4 |  -.0732809   .0733747    -1.00   0.318    -.2170927     .070531
          info_cc_5 |  -.0685758   .0882185    -0.78   0.437    -.2414808    .1043292
              orga2 |  -.0938487   .0837754    -1.12   0.263    -.2580454    .0703481
              orga3 |   .1495774   .0877038     1.71   0.088    -.0223189    .3214736
              orga4 |   .0092723   .0790602     0.12   0.907    -.1456828    .1642274
      cops_attended |    .016434   .0045244     3.63   0.000     .0075664    .0253016
               edu1 |    .035085   .0698831     0.50   0.616    -.1018834    .1720533
               edu3 |  -.0704036   .0857105    -0.82   0.411     -.238393    .0975858
               edu4 |  -.0743944   .1034154    -0.72   0.472    -.2770848     .128296
               edu5 |   .0148873   .1037193     0.14   0.886    -.1883988    .2181733
lower_middle_income |  -.0285035   .0726737    -0.39   0.695    -.1709414    .1139344
upper_middle_income |   .0525916   .0859438     0.61   0.541    -.1158552    .2210384
        high_income |  -.3564775    .091764    -3.88   0.000    -.5363316   -.1766234
         treat_tech |  -.0750204   .0533039    -1.41   0.159     -.179494    .0294533
-------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .21046748

. * Col 2: Price < USD82
. probit price_below_82 temp_rise tech_ms_pca $info_source $orga cops_attended $socioeconomics
>  $countryspecifics treat_tech, vce(robust)

Iteration 0:   log pseudolikelihood = -182.26808  
Iteration 1:   log pseudolikelihood = -148.69252  
Iteration 2:   log pseudolikelihood =  -148.4783  
Iteration 3:   log pseudolikelihood = -148.47806  
Iteration 4:   log pseudolikelihood = -148.47806  

Probit regression                               Number of obs     =        277
                                                Wald chi2(19)     =      64.58
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -148.47806               Pseudo R2         =     0.1854

-------------------------------------------------------------------------------------
                    |               Robust
     price_below_82 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          temp_rise |   .1521178   .1029622     1.48   0.140    -.0496844      .35392
        tech_ms_pca |   .2474991   .0673976     3.67   0.000     .1154023    .3795959
          info_cc_1 |   .0784356   .2130452     0.37   0.713    -.3391253    .4959965
          info_cc_2 |  -.1759691    .191164    -0.92   0.357    -.5506438    .1987055
          info_cc_3 |  -.0201643   .2651581    -0.08   0.939    -.5398647    .4995361
          info_cc_4 |  -.1508666   .2526417    -0.60   0.550    -.6460352     .344302
          info_cc_5 |  -.0890697   .2857285    -0.31   0.755    -.6490874    .4709479
              orga2 |  -.0837328    .290657    -0.29   0.773    -.6534101    .4859445
              orga3 |   .0244492   .3036611     0.08   0.936    -.5707157     .619614
              orga4 |   .2634226   .2519335     1.05   0.296     -.230358    .7572033
      cops_attended |   .0425053   .0151659     2.80   0.005     .0127808    .0722299
               edu1 |  -.2967819   .2340742    -1.27   0.205    -.7555589    .1619951
               edu3 |  -.2974946   .2786825    -1.07   0.286    -.8437023    .2487131
               edu4 |  -.3622729   .3239927    -1.12   0.264     -.997287    .2727412
               edu5 |  -.0994903   .3487929    -0.29   0.775    -.7831119    .5841313
lower_middle_income |   .1203896   .2464768     0.49   0.625    -.3626961    .6034752
upper_middle_income |   .4003714   .3028293     1.32   0.186    -.1931631    .9939058
        high_income |  -.6831394   .2900826    -2.35   0.019    -1.251691   -.1145879
         treat_tech |  -.4650987   .1735995    -2.68   0.007    -.8053476   -.1248499
              _cons |   .7102254   .4333604     1.64   0.101    -.1391454    1.559596
-------------------------------------------------------------------------------------

. local r2_p = e(r2_p)

. eststo table_6_2: margins, dydx(*) post

Average marginal effects                        Number of obs     =        277
Model VCE    : Robust

Expression   : Pr(price_below_82), predict()
dy/dx w.r.t. : temp_rise tech_ms_pca info_cc_1 info_cc_2 info_cc_3 info_cc_4 info_cc_5 orga2
               orga3 orga4 cops_attended edu1 edu3 edu4 edu5 lower_middle_income
               upper_middle_income high_income treat_tech

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          temp_rise |   .0459727   .0309843     1.48   0.138    -.0147555    .1067009
        tech_ms_pca |   .0747986   .0188617     3.97   0.000     .0378304    .1117668
          info_cc_1 |   .0237046   .0644014     0.37   0.713    -.1025198     .149929
          info_cc_2 |   -.053181    .057557    -0.92   0.356    -.1659906    .0596286
          info_cc_3 |   -.006094   .0801006    -0.08   0.939    -.1630884    .1509004
          info_cc_4 |  -.0455945    .076163    -0.60   0.549    -.1948713    .1036822
          info_cc_5 |  -.0269185   .0863478    -0.31   0.755    -.1961569      .14232
              orga2 |  -.0253055   .0878748    -0.29   0.773     -.197537    .1469259
              orga3 |    .007389   .0917708     0.08   0.936    -.1724784    .1872564
              orga4 |    .079611   .0757666     1.05   0.293    -.0688888    .2281108
      cops_attended |   .0128459   .0045297     2.84   0.005     .0039678    .0217239
               edu1 |  -.0896927   .0703455    -1.28   0.202    -.2275674    .0481819
               edu3 |  -.0899081   .0837942    -1.07   0.283    -.2541418    .0743255
               edu4 |  -.1094853   .0978208    -1.12   0.263    -.3012105      .08224
               edu5 |  -.0300677    .105476    -0.29   0.776    -.2367969    .1766614
lower_middle_income |   .0363839   .0743411     0.49   0.625    -.1093221    .1820898
upper_middle_income |   .1209993   .0903825     1.34   0.181    -.0561471    .2981457
        high_income |  -.2064568   .0858697    -2.40   0.016    -.3747583   -.0381553
         treat_tech |  -.1405611   .0513692    -2.74   0.006    -.2412428   -.0398793
-------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .18538636

. * Col 3: Price < USD185
. probit price_below_185 temp_rise tech_ms_pca $info_source $orga cops_attended $socioeconomic
> s $countryspecifics treat_tech, vce(robust)

Iteration 0:   log pseudolikelihood = -135.21866  
Iteration 1:   log pseudolikelihood = -122.99535  
Iteration 2:   log pseudolikelihood = -122.86622  
Iteration 3:   log pseudolikelihood = -122.86621  
Iteration 4:   log pseudolikelihood = -122.86621  

Probit regression                               Number of obs     =        277
                                                Wald chi2(19)     =      27.04
                                                Prob > chi2       =     0.1038
Log pseudolikelihood = -122.86621               Pseudo R2         =     0.0914

-------------------------------------------------------------------------------------
                    |               Robust
    price_below_185 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          temp_rise |   .1638403   .1087561     1.51   0.132    -.0493177    .3769983
        tech_ms_pca |   .1352138   .0682535     1.98   0.048     .0014393    .2689883
          info_cc_1 |   .1516294   .2218168     0.68   0.494    -.2831235    .5863824
          info_cc_2 |   .0939798   .1993391     0.47   0.637    -.2967176    .4846772
          info_cc_3 |   .1588848   .2786562     0.57   0.569    -.3872712    .7050409
          info_cc_4 |  -.1893984   .2662603    -0.71   0.477    -.7112589    .3324621
          info_cc_5 |  -.0153934     .29299    -0.05   0.958    -.5896432    .5588563
              orga2 |   .1405943   .3137574     0.45   0.654    -.4743589    .7555475
              orga3 |  -.2507003   .3097406    -0.81   0.418    -.8577808    .3563801
              orga4 |   .1720605   .2577413     0.67   0.504    -.3331032    .6772242
      cops_attended |   .0324806   .0177238     1.83   0.067    -.0022573    .0672185
               edu1 |  -.0476298    .258934    -0.18   0.854    -.5551311    .4598714
               edu3 |  -.4772997   .2869899    -1.66   0.096     -1.03979    .0851903
               edu4 |  -.1576998   .3474244    -0.45   0.650    -.8386393    .5232396
               edu5 |   .1901829   .4014293     0.47   0.636     -.596604    .9769698
lower_middle_income |   .2719133   .2726072     1.00   0.319     -.262387    .8062136
upper_middle_income |   .2223147   .3219126     0.69   0.490    -.4086224    .8532518
        high_income |  -.1959092   .3034425    -0.65   0.519    -.7906456    .3988271
         treat_tech |  -.2009749   .1868377    -1.08   0.282      -.56717    .1652202
              _cons |   .4970712   .4382887     1.13   0.257    -.3619589    1.356101
-------------------------------------------------------------------------------------

. local r2_p = e(r2_p)

. eststo table_6_3: margins, dydx(*) post

Average marginal effects                        Number of obs     =        277
Model VCE    : Robust

Expression   : Pr(price_below_185), predict()
dy/dx w.r.t. : temp_rise tech_ms_pca info_cc_1 info_cc_2 info_cc_3 info_cc_4 info_cc_5 orga2
               orga3 orga4 cops_attended edu1 edu3 edu4 edu5 lower_middle_income
               upper_middle_income high_income treat_tech

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          temp_rise |   .0405454   .0265539     1.53   0.127    -.0114993      .09259
        tech_ms_pca |   .0334612   .0166108     2.01   0.044     .0009046    .0660178
          info_cc_1 |   .0375236   .0549312     0.68   0.495    -.0701395    .1451867
          info_cc_2 |   .0232571    .049337     0.47   0.637    -.0734416    .1199558
          info_cc_3 |   .0393191   .0688769     0.57   0.568    -.0956771    .1743152
          info_cc_4 |  -.0468702    .065754    -0.71   0.476    -.1757457    .0820052
          info_cc_5 |  -.0038094   .0725347    -0.05   0.958    -.1459748     .138356
              orga2 |   .0347927    .077625     0.45   0.654    -.1173494    .1869348
              orga3 |  -.0620406   .0761516    -0.81   0.415     -.211295    .0872139
              orga4 |   .0425796   .0638936     0.67   0.505    -.0826495    .1678088
      cops_attended |   .0080379   .0044081     1.82   0.068    -.0006018    .0166777
               edu1 |  -.0117869   .0641065    -0.18   0.854    -.1374333    .1138595
               edu3 |  -.1181168   .0703189    -1.68   0.093    -.2559393    .0197056
               edu4 |  -.0390258   .0860726    -0.45   0.650     -.207725    .1296733
               edu5 |   .0470644   .0991833     0.47   0.635    -.1473312      .24146
lower_middle_income |   .0672901   .0672982     1.00   0.317    -.0646119     .199192
upper_middle_income |    .055016   .0795336     0.69   0.489     -.100867     .210899
        high_income |  -.0484814   .0749823    -0.65   0.518    -.1954441    .0984812
         treat_tech |  -.0497351   .0463057    -1.07   0.283    -.1404926    .0410225
-------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .0913517

. * Col 4: Price < USD281
. probit price_below_281 temp_rise tech_ms_pca $info_source $orga cops_attended $socioeconomic
> s $countryspecifics treat_tech, vce(robust)

Iteration 0:   log pseudolikelihood = -107.01011  
Iteration 1:   log pseudolikelihood = -97.388349  
Iteration 2:   log pseudolikelihood = -97.115422  
Iteration 3:   log pseudolikelihood = -97.114725  
Iteration 4:   log pseudolikelihood = -97.114725  

Probit regression                               Number of obs     =        277
                                                Wald chi2(19)     =      20.22
                                                Prob > chi2       =     0.3815
Log pseudolikelihood = -97.114725               Pseudo R2         =     0.0925

-------------------------------------------------------------------------------------
                    |               Robust
    price_below_281 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          temp_rise |   .3222387   .1233691     2.61   0.009     .0804398    .5640376
        tech_ms_pca |   .1012132   .0745321     1.36   0.174    -.0448672    .2472935
          info_cc_1 |   .2989742   .2341373     1.28   0.202    -.1599263    .7578748
          info_cc_2 |   .0311539   .2249827     0.14   0.890    -.4098042     .472112
          info_cc_3 |   .1595909   .3035629     0.53   0.599    -.4353816    .7545633
          info_cc_4 |  -.0234232   .2659997    -0.09   0.930    -.5447731    .4979266
          info_cc_5 |  -.2591758   .3403411    -0.76   0.446    -.9262321    .4078805
              orga2 |   .4243411   .3954008     1.07   0.283    -.3506301    1.199312
              orga3 |   .0131683   .3413956     0.04   0.969    -.6559548    .6822913
              orga4 |   .3410813   .3076989     1.11   0.268    -.2619974      .94416
      cops_attended |   .0285208   .0204656     1.39   0.163    -.0115909    .0686326
               edu1 |   .0182656   .2607513     0.07   0.944    -.4927975    .5293287
               edu3 |  -.4314362   .3035868    -1.42   0.155    -1.026455    .1635829
               edu4 |   .2576076   .4168707     0.62   0.537    -.5594439    1.074659
               edu5 |   .0811506   .3958003     0.21   0.838    -.6946037    .8569048
lower_middle_income |   .2073257   .2789644     0.74   0.457    -.3394345    .7540858
upper_middle_income |   .2476537   .3256392     0.76   0.447    -.3905874    .8858949
        high_income |   .1635309   .3276178     0.50   0.618    -.4785882    .8056501
         treat_tech |  -.0977854   .2093863    -0.47   0.640     -.508175    .3126041
              _cons |   .3225745   .5124129     0.63   0.529    -.6817363    1.326885
-------------------------------------------------------------------------------------

. local r2_p = e(r2_p)

. eststo table_6_4: margins, dydx(*) post

Average marginal effects                        Number of obs     =        277
Model VCE    : Robust

Expression   : Pr(price_below_281), predict()
dy/dx w.r.t. : temp_rise tech_ms_pca info_cc_1 info_cc_2 info_cc_3 info_cc_4 info_cc_5 orga2
               orga3 orga4 cops_attended edu1 edu3 edu4 edu5 lower_middle_income
               upper_middle_income high_income treat_tech

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          temp_rise |    .062151   .0232755     2.67   0.008     .0165318    .1077702
        tech_ms_pca |   .0195212   .0142999     1.37   0.172     -.008506    .0475484
          info_cc_1 |   .0576639   .0446969     1.29   0.197    -.0299404    .1452683
          info_cc_2 |   .0060087   .0434038     0.14   0.890    -.0790612    .0910786
          info_cc_3 |   .0307807   .0584698     0.53   0.599     -.083818    .1453794
          info_cc_4 |  -.0045177    .051304    -0.09   0.930    -.1050716    .0960362
          info_cc_5 |  -.0499879   .0661754    -0.76   0.450    -.1796893    .0797134
              orga2 |   .0818438   .0763777     1.07   0.284    -.0678537    .2315412
              orga3 |   .0025398   .0658555     0.04   0.969    -.1265346    .1316142
              orga4 |   .0657852   .0591065     1.11   0.266    -.0500614    .1816319
      cops_attended |   .0055009   .0039876     1.38   0.168    -.0023147    .0133165
               edu1 |   .0035229   .0502637     0.07   0.944    -.0949921     .102038
               edu3 |  -.0832122   .0586476    -1.42   0.156    -.1981594     .031735
               edu4 |   .0496855   .0798925     0.62   0.534     -.106901    .2062719
               edu5 |   .0156517   .0763362     0.21   0.838    -.1339644    .1652679
lower_middle_income |   .0399874   .0539343     0.74   0.458    -.0657219    .1456968
upper_middle_income |   .0477656   .0627646     0.76   0.447    -.0752507    .1707819
        high_income |   .0315406   .0632865     0.50   0.618    -.0924986    .1555798
         treat_tech |  -.0188601    .040337    -0.47   0.640    -.0979192    .0601989
-------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .09247147

. 
. esttab table_6_1 table_6_2 table_6_3 table_6_4 using  "$working_ANALYSIS/results/tables/Tabl
> e S5.rtf", p mtitles("Price below 37USD" "Price below 82USD" "Price below 185USD" "Price bel
> ow 281USD") b(%4.2f) order(temp_rise tech_ms_pca Info_source $info_source Orga_working $orga
>  SocioEcon cops_attended $socioeconomics Country-level)  label stats(N r2_p, labels("N" "Pse
> udo R-squared" ) fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_co
> ns "{break}{hline @width}")) nonotes replace
(output written to C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia
> _Delegates\8_Submission\replication_delegates/results/tables/Table S5.rtf)

. 
. 
. 
. ** Figure S5: Detailed view on global carbon prices named for the section 0USD to 50USD
. 
. * Global carbon price and temperature rise 
. * Global Generate variable defining position of observations on x-axis
. egen carbon_price_rank = rank(carbon_price_cap), by(temp_rise_cropped) unique
variable carbon_price_rank already defined
r(110);

end of do-file
r(110);

end of do-file

r(110);

. do "C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Donia_Delegates\8_
> Submission\replication_delegates\run.do"

. *-------------------------------------------------------------------------------------------
> ------------
. * OVERVIEW
. *-------------------------------------------------------------------------------------------
> ------------
. *   This script generates tables and figures reported in the manuscript and SOM of the paper
> :
. *   TECHNOLOGY-MINDED CLIMATE DELEGATES SUPPORT LESS STRINGENT CLIMATE POLICIES
. *       Author: Max Burger, Philipps University Marburg
. *   All survey data are stored in /data
. *   All figures reported in the main manuscript and SOM are outputted to /results/figures
. *   All tables areported in the main manuscript and SOM are outputted to /results/tables
. *   TO PERFORM A CLEAN RUN, DELETE THE FOLLOWING FOLDER:
. *    /results
. *-------------------------------------------------------------------------------------------
> ------------
. 
. 
. 
. *--------------------------------------------------
. * Set global Working Directory
. *--------------------------------------------------
. * Define this global macro to point where the replication folder is saved locally that inclu
> des this run.do script
. global working_ANALYSIS "C:\Users\Max Burger\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustU
> se\Donia_Delegates\8_Submission\replication_delegates"

. 
. 
. *--------------------------------------------------
. * Program Setup
. *--------------------------------------------------
. * Initialize log and record system parameters
. clear

. set more off

. cap mkdir "$working_ANALYSIS/scripts/logs"

. cap log close
